Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1570 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 30 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xcb489): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xd1890): ../Source/APP/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x9d9d2): C:/Users/iot13/OneDrive - teltonika.lt/Desktop/MustafaOrhonTrainingFiles/mustafa_orhon/STM32CubeIDE_Project/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 31 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 13 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x120b7): unsigned int
 <1><38>: Abbrev Number: 13 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)

    <2fa>   DW_AT_name        : (indirect string, offset: 0x6e13b): CAN2_TX_IRQn
    <2fe>   DW_AT_const_value : 63
 <2><2ff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <300>   DW_AT_name        : (indirect string, offset: 0x34446): CAN2_RX0_IRQn
    <304>   DW_AT_const_value : 64
 <2><305>: Abbrev Number: 1 (DW_TAG_enumerator)
    <306>   DW_AT_name        : (indirect string, offset: 0x8aab4): CAN2_RX1_IRQn
    <30a>   DW_AT_const_value : 65
 <2><30b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <30c>   DW_AT_name        : (indirect string, offset: 0xcf591): CAN2_SCE_IRQn
    <310>   DW_AT_const_value : 66
 <2><311>: Abbrev Number: 1 (DW_TAG_enumerator)
    <312>   DW_AT_name        : (indirect string, offset: 0x7c1bd): OTG_FS_IRQn
    <316>   DW_AT_const_value : 67
 <2><317>: Abbrev Number: 1 (DW_TAG_enumerator)
    <318>   DW_AT_name        : (indirect string, offset: 0xb8661): DMA2_Stream5_IRQn
    <31c>   DW_AT_const_value : 68
 <2><31d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <31e>   DW_AT_name        : (indirect string, offset: 0x3fff8): DMA2_Stream6_IRQn
    <322>   DW_AT_const_value : 69
 <2><323>: Abbrev Number: 1 (DW_TAG_enumerator)
    <324>   DW_AT_name        : (indirect string, offset: 0xa3a48): DMA2_Stream7_IRQn
    <328>   DW_AT_const_value : 70
 <2><329>: Abbrev Number: 1 (DW_TAG_enumerator)
    <32a>   DW_AT_name        : (indirect string, offset: 0xdc5dd): USART6_IRQn
    <32e>   DW_AT_const_value : 71
 <2><32f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <330>   DW_AT_name        : (indirect string, offset: 0xc36ce): I2C3_EV_IRQn
    <334>   DW_AT_const_value : 72
 <2><335>: Abbrev Number: 1 (DW_TAG_enumerator)
    <336>   DW_AT_name        : (indirect string, offset: 0x249df): I2C3_ER_IRQn
    <33a>   DW_AT_const_value : 73
 <2><33b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <33c>   DW_AT_name        : (indirect string, offset: 0x62ab4): CAN3_TX_IRQn
    <340>   DW_AT_const_value : 74
 <2><341>: Abbrev Number: 1 (DW_TAG_enumerator)
    <342>   DW_AT_name        : (indirect string, offset: 0x221af): CAN3_RX0_IRQn
    <346>   DW_AT_const_value : 75
 <2><347>: Abbrev Number: 1 (DW_TAG_enumerator)
    <348>   DW_AT_name        : (indirect string, offset: 0x797f7): CAN3_RX1_IRQn
    <34c>   DW_AT_const_value : 76
 <2><34d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <34e>   DW_AT_name        : (indirect string, offset: 0x844b0): CAN3_SCE_IRQn
    <352>   DW_AT_const_value : 77
 <2><353>: Abbrev Number: 1 (DW_TAG_enumerator)
    <354>   DW_AT_name        : (indirect string, offset: 0x1936e): RNG_IRQn
    <358>   DW_AT_const_value : 80
 <2><359>: Abbrev Number: 1 (DW_TAG_enumerator)
    <35a>   DW_AT_name        : (indirect string, offset: 0x46b18): FPU_IRQn
    <35e>   DW_AT_const_value : 81
 <2><35f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <360>   DW_AT_name        : (indirect string, offset: 0x12134): UART7_IRQn
    <364>   DW_AT_const_value : 82
 <2><365>: Abbrev Number: 1 (DW_TAG_enumerator)
    <366>   DW_AT_name        : (indirect string, offset: 0x62aa9): UART8_IRQn
    <36a>   DW_AT_const_value : 83
 <2><36b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <36c>   DW_AT_name        : (indirect string, offset: 0x5da6b): SPI4_IRQn
    <370>   DW_AT_const_value : 84
 <2><371>: Abbrev Number: 1 (DW_TAG_enumerator)
    <372>   DW_AT_name        : (indirect string, offset: 0xc1e60): SPI5_IRQn
    <376>   DW_AT_const_value : 85
 <2><377>: Abbrev Number: 1 (DW_TAG_enumerator)
    <378>   DW_AT_name        : (indirect string, offset: 0x56fc3): SAI1_IRQn
    <37c>   DW_AT_const_value : 87
 <2><37d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <37e>   DW_AT_name        : (indirect string, offset: 0xbc49b): UART9_IRQn
    <382>   DW_AT_const_value : 88
 <2><383>: Abbrev Number: 1 (DW_TAG_enumerator)
    <384>   DW_AT_name        : (indirect string, offset: 0x41b9c): UART10_IRQn
    <388>   DW_AT_const_value : 89
 <2><389>: Abbrev Number: 1 (DW_TAG_enumerator)
    <38a>   DW_AT_name        : (indirect string, offset: 0x6c41f): QUADSPI_IRQn
    <38e>   DW_AT_const_value : 92
 <2><38f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <390>   DW_AT_name        : (indirect string, offset: 0x18f62): FMPI2C1_EV_IRQn
    <394>   DW_AT_const_value : 95
 <2><395>: Abbrev Number: 1 (DW_TAG_enumerator)
    <396>   DW_AT_name        : (indirect string, offset: 0x55f7c): FMPI2C1_ER_IRQn
    <39a>   DW_AT_const_value : 96
 <2><39b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <39c>   DW_AT_name        : (indirect string, offset: 0xa8aaa): LPTIM1_IRQn
    <3a0>   DW_AT_const_value : 97
 <2><3a1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a2>   DW_AT_name        : (indirect string, offset: 0xbb62c): DFSDM2_FLT0_IRQn
    <3a6>   DW_AT_const_value : 98
 <2><3a7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a8>   DW_AT_name        : (indirect string, offset: 0xb84d9): DFSDM2_FLT1_IRQn
    <3ac>   DW_AT_const_value : 99
 <2><3ad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3ae>   DW_AT_name        : (indirect string, offset: 0x126cd): DFSDM2_FLT2_IRQn
    <3b2>   DW_AT_const_value : 100
 <2><3b3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3b4>   DW_AT_name        : (indirect string, offset: 0x25cc3): DFSDM2_FLT3_IRQn
    <3b8>   DW_AT_const_value : 101
 <2><3b9>: Abbrev Number: 0
 <1><3ba>: Abbrev Number: 6 (DW_TAG_typedef)
    <3bb>   DW_AT_name        : (indirect string, offset: 0xbf4f7): IRQn_Type
    <3bf>   DW_AT_decl_file   : 12
    <3c0>   DW_AT_decl_line   : 171
    <3c1>   DW_AT_decl_column : 3
    <3c2>   DW_AT_type        : <0x147>
 <1><3c6>: Abbrev Number: 34 (DW_TAG_structure_type)
    <3c7>   DW_AT_byte_size   : 3588
    <3c9>   DW_AT_decl_file   : 1
    <3ca>   DW_AT_decl_line   : 406
    <3cc>   DW_AT_decl_column : 9
    <3cd>   DW_AT_sibling     : <0x480>
 <2><3d1>: Abbrev Number: 2 (DW_TAG_member)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x6a909): ISER
    <3d6>   DW_AT_decl_file   : 1
    <3d7>   DW_AT_decl_line   : 408
    <3d9>   DW_AT_decl_column : 18
    <3da>   DW_AT_type        : <0x490>
    <3de>   DW_AT_data_member_location: 0
 <2><3df>: Abbrev Number: 2 (DW_TAG_member)
    <3e0>   DW_AT_name        : (indirect string, offset: 0xcf376): RESERVED0
    <3e4>   DW_AT_decl_file   : 1
    <3e5>   DW_AT_decl_line   : 409
    <3e7>   DW_AT_decl_column : 18
    <3e8>   DW_AT_type        : <0x495>
    <3ec>   DW_AT_data_member_location: 32
 <2><3ed>: Abbrev Number: 2 (DW_TAG_member)
    <3ee>   DW_AT_name        : (indirect string, offset: 0xba85e): ICER
    <3f2>   DW_AT_decl_file   : 1
    <3f3>   DW_AT_decl_line   : 410
    <3f5>   DW_AT_decl_column : 18
    <3f6>   DW_AT_type        : <0x490>
    <3fa>   DW_AT_data_member_location: 128
 <2><3fb>: Abbrev Number: 2 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x9ff3d): RSERVED1
    <400>   DW_AT_decl_file   : 1
    <401>   DW_AT_decl_line   : 411
    <403>   DW_AT_decl_column : 18
    <404>   DW_AT_type        : <0x495>
    <408>   DW_AT_data_member_location: 160
 <2><409>: Abbrev Number: 14 (DW_TAG_member)
    <40a>   DW_AT_name        : (indirect string, offset: 0x6f5c3): ISPR
    <40e>   DW_AT_decl_file   : 1
    <40e>   DW_AT_decl_line   : 412
    <410>   DW_AT_decl_column : 18
    <410>   DW_AT_type        : <0x490>
    <414>   DW_AT_data_member_location: 256
 <2><416>: Abbrev Number: 14 (DW_TAG_member)
    <417>   DW_AT_name        : (indirect string, offset: 0xcf38a): RESERVED2
    <41b>   DW_AT_decl_file   : 1
    <41b>   DW_AT_decl_line   : 413
    <41d>   DW_AT_decl_column : 18
    <41d>   DW_AT_type        : <0x495>
    <421>   DW_AT_data_member_location: 288
 <2><423>: Abbrev Number: 14 (DW_TAG_member)
    <424>   DW_AT_name        : (indirect string, offset: 0x451df): ICPR
    <428>   DW_AT_decl_file   : 1
    <428>   DW_AT_decl_line   : 414
    <42a>   DW_AT_decl_column : 18
    <42a>   DW_AT_type        : <0x490>
    <42e>   DW_AT_data_member_location: 384
 <2><430>: Abbrev Number: 14 (DW_TAG_member)
    <431>   DW_AT_name        : (indirect string, offset: 0xcf394): RESERVED3
    <435>   DW_AT_decl_file   : 1
    <435>   DW_AT_decl_line   : 415
    <437>   DW_AT_decl_column : 18
    <437>   DW_AT_type        : <0x495>
    <43b>   DW_AT_data_member_location: 416
 <2><43d>: Abbrev Number: 14 (DW_TAG_member)
    <43e>   DW_AT_name        : (indirect string, offset: 0x2cea): IABR
    <442>   DW_AT_decl_file   : 1
    <442>   DW_AT_decl_line   : 416
    <444>   DW_AT_decl_column : 18
    <444>   DW_AT_type        : <0x490>
    <448>   DW_AT_data_member_location: 512
 <2><44a>: Abbrev Number: 14 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0xcf39e): RESERVED4
    <44f>   DW_AT_decl_file   : 1
    <44f>   DW_AT_decl_line   : 417
    <451>   DW_AT_decl_column : 18
    <451>   DW_AT_type        : <0x4a5>
    <455>   DW_AT_data_member_location: 544
 <2><457>: Abbrev Number: 35 (DW_TAG_member)
    <458>   DW_AT_name        : IP
    <45b>   DW_AT_decl_file   : 1
    <45c>   DW_AT_decl_line   : 418
    <45e>   DW_AT_decl_column : 18
    <45f>   DW_AT_type        : <0x4c5>
    <463>   DW_AT_data_member_location: 768
 <2><465>: Abbrev Number: 14 (DW_TAG_member)
    <466>   DW_AT_name        : (indirect string, offset: 0xcf3a8): RESERVED5
    <46a>   DW_AT_decl_file   : 1
    <46a>   DW_AT_decl_line   : 419
    <46c>   DW_AT_decl_column : 18
    <46c>   DW_AT_type        : <0x4ca>
    <470>   DW_AT_data_member_location: 1008
 <2><472>: Abbrev Number: 14 (DW_TAG_member)
    <473>   DW_AT_name        : (indirect string, offset: 0x6721a): STIR
    <477>   DW_AT_decl_file   : 1
    <477>   DW_AT_decl_line   : 420
    <479>   DW_AT_decl_column : 18
    <479>   DW_AT_type        : <0xe6>
    <47d>   DW_AT_data_member_location: 3584
 <2><47f>: Abbrev Number: 0
 <1><480>: Abbrev Number: 8 (DW_TAG_array_type)
    <481>   DW_AT_type        : <0xe6>
    <485>   DW_AT_sibling     : <0x490>
 <2><489>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <48a>   DW_AT_type        : <0x31>
    <48e>   DW_AT_upper_bound : 7
 <2><48f>: Abbrev Number: 0
 <1><490>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <491>   DW_AT_type        : <0x480>
 <1><495>: Abbrev Number: 8 (DW_TAG_array_type)
    <496>   DW_AT_type        : <0xda>
    <49a>   DW_AT_sibling     : <0x4a5>
 <2><49e>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <49f>   DW_AT_type        : <0x31>
    <4a3>   DW_AT_upper_bound : 23
 <2><4a4>: Abbrev Number: 0
 <1><4a5>: Abbrev Number: 8 (DW_TAG_array_type)
    <4a6>   DW_AT_type        : <0xda>
    <4aa>   DW_AT_sibling     : <0x4b5>
 <2><4ae>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4af>   DW_AT_type        : <0x31>
    <4b3>   DW_AT_upper_bound : 55
 <2><4b4>: Abbrev Number: 0
 <1><4b5>: Abbrev Number: 8 (DW_TAG_array_type)
    <4b6>   DW_AT_type        : <0xb8>
    <4ba>   DW_AT_sibling     : <0x4c5>
 <2><4be>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <4bf>   DW_AT_type        : <0x31>
    <4c3>   DW_AT_upper_bound : 239
 <2><4c4>: Abbrev Number: 0
 <1><4c5>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <4c6>   DW_AT_type        : <0x4b5>
 <1><4ca>: Abbrev Number: 8 (DW_TAG_array_type)
    <4cb>   DW_AT_type        : <0xda>
    <4cf>   DW_AT_sibling     : <0x4db>
 <2><4d3>: Abbrev Number: 36 (DW_TAG_subrange_type)
    <4d4>   DW_AT_type        : <0x31>
    <4d8>   DW_AT_upper_bound : 643
 <2><4da>: Abbrev Number: 0
 <1><4db>: Abbrev Number: 12 (DW_TAG_typedef)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x68b4e): NVIC_Type
    <4e0>   DW_AT_decl_file   : 1
    <4e1>   DW_AT_decl_line   : 421
    <4e3>   DW_AT_decl_column : 4
    <4e4>   DW_AT_type        : <0x3c6>
 <1><4e8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <4e9>   DW_AT_byte_size   : 140
    <4ea>   DW_AT_decl_file   : 1
    <4eb>   DW_AT_decl_line   : 440
    <4ed>   DW_AT_decl_column : 9
    <4ed>   DW_AT_sibling     : <0x618>
 <2><4f1>: Abbrev Number: 2 (DW_TAG_member)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x47827): CPUID
    <4f6>   DW_AT_decl_file   : 1
    <4f7>   DW_AT_decl_line   : 442
    <4f9>   DW_AT_decl_column : 18
    <4fa>   DW_AT_type        : <0xeb>
    <4fe>   DW_AT_data_member_location: 0
 <2><4ff>: Abbrev Number: 2 (DW_TAG_member)
    <500>   DW_AT_name        : (indirect string, offset: 0x46888): ICSR
    <504>   DW_AT_decl_file   : 1
    <505>   DW_AT_decl_line   : 443
    <507>   DW_AT_decl_column : 18
    <508>   DW_AT_type        : <0xe6>
    <50c>   DW_AT_data_member_location: 4
 <2><50d>: Abbrev Number: 2 (DW_TAG_member)
    <50e>   DW_AT_name        : (indirect string, offset: 0x7b31): VTOR
    <512>   DW_AT_decl_file   : 1
    <513>   DW_AT_decl_line   : 444
    <515>   DW_AT_decl_column : 18
    <516>   DW_AT_type        : <0xe6>
    <51a>   DW_AT_data_member_location: 8
 <2><51b>: Abbrev Number: 2 (DW_TAG_member)
    <51c>   DW_AT_name        : (indirect string, offset: 0x1d981): AIRCR
    <520>   DW_AT_decl_file   : 1
    <521>   DW_AT_decl_line   : 445
    <523>   DW_AT_decl_column : 18
    <524>   DW_AT_type        : <0xe6>
    <528>   DW_AT_data_member_location: 12
 <2><529>: Abbrev Number: 4 (DW_TAG_member)
    <52a>   DW_AT_name        : SCR
    <52e>   DW_AT_decl_file   : 1
    <52f>   DW_AT_decl_line   : 446
    <531>   DW_AT_decl_column : 18
    <532>   DW_AT_type        : <0xe6>
    <536>   DW_AT_data_member_location: 16
 <2><537>: Abbrev Number: 4 (DW_TAG_member)
    <538>   DW_AT_name        : CCR
    <53c>   DW_AT_decl_file   : 1
    <53d>   DW_AT_decl_line   : 447
    <53f>   DW_AT_decl_column : 18
    <540>   DW_AT_type        : <0xe6>
    <544>   DW_AT_data_member_location: 20
 <2><545>: Abbrev Number: 4 (DW_TAG_member)
    <546>   DW_AT_name        : SHP
    <54a>   DW_AT_decl_file   : 1
    <54b>   DW_AT_decl_line   : 448
    <54d>   DW_AT_decl_column : 18
    <54e>   DW_AT_type        : <0x628>
    <552>   DW_AT_data_member_location: 24
 <2><553>: Abbrev Number: 2 (DW_TAG_member)
    <554>   DW_AT_name        : (indirect string, offset: 0x74552): SHCSR
    <558>   DW_AT_decl_file   : 1
    <559>   DW_AT_decl_line   : 449
    <55b>   DW_AT_decl_column : 18
    <55c>   DW_AT_type        : <0xe6>
    <560>   DW_AT_data_member_location: 36
 <2><561>: Abbrev Number: 2 (DW_TAG_member)
    <562>   DW_AT_name        : (indirect string, offset: 0x89c49): CFSR
    <566>   DW_AT_decl_file   : 1
    <567>   DW_AT_decl_line   : 450
    <569>   DW_AT_decl_column : 18
    <56a>   DW_AT_type        : <0xe6>
    <56e>   DW_AT_data_member_location: 40
 <2><56f>: Abbrev Number: 2 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x781af): HFSR
    <574>   DW_AT_decl_file   : 1
    <575>   DW_AT_decl_line   : 451
    <577>   DW_AT_decl_column : 18
    <578>   DW_AT_type        : <0xe6>
    <57c>   DW_AT_data_member_location: 44
 <2><57d>: Abbrev Number: 2 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0xb27a3): DFSR
    <582>   DW_AT_decl_file   : 1
    <583>   DW_AT_decl_line   : 452
    <585>   DW_AT_decl_column : 18
    <586>   DW_AT_type        : <0xe6>
    <58a>   DW_AT_data_member_location: 48
 <2><58b>: Abbrev Number: 2 (DW_TAG_member)
    <58c>   DW_AT_name        : (indirect string, offset: 0xc6f09): MMFAR
    <590>   DW_AT_decl_file   : 1
    <591>   DW_AT_decl_line   : 453
    <593>   DW_AT_decl_column : 18
    <594>   DW_AT_type        : <0xe6>
    <598>   DW_AT_data_member_location: 52
 <2><599>: Abbrev Number: 2 (DW_TAG_member)
    <59a>   DW_AT_name        : (indirect string, offset: 0x59865): BFAR
    <59e>   DW_AT_decl_file   : 1
    <59f>   DW_AT_decl_line   : 454
    <5a1>   DW_AT_decl_column : 18
    <5a2>   DW_AT_type        : <0xe6>
    <5a6>   DW_AT_data_member_location: 56
 <2><5a7>: Abbrev Number: 2 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x3417c): AFSR
    <5ac>   DW_AT_decl_file   : 1
    <5ad>   DW_AT_decl_line   : 455
    <5af>   DW_AT_decl_column : 18
    <5b0>   DW_AT_type        : <0xe6>
    <5b4>   DW_AT_data_member_location: 60
 <2><5b5>: Abbrev Number: 4 (DW_TAG_member)
    <5b6>   DW_AT_name        : PFR
    <5ba>   DW_AT_decl_file   : 1
    <5bb>   DW_AT_decl_line   : 456
    <5bd>   DW_AT_decl_column : 18
    <5be>   DW_AT_type        : <0x642>
    <5c2>   DW_AT_data_member_location: 64
 <2><5c3>: Abbrev Number: 4 (DW_TAG_member)
    <5c4>   DW_AT_name        : DFR
    <5c8>   DW_AT_decl_file   : 1
    <5c9>   DW_AT_decl_line   : 457
    <5cb>   DW_AT_decl_column : 18
    <5cc>   DW_AT_type        : <0xeb>
    <5d0>   DW_AT_data_member_location: 72
 <2><5d1>: Abbrev Number: 4 (DW_TAG_member)
    <5d2>   DW_AT_name        : ADR
    <5d6>   DW_AT_decl_file   : 1
    <5d7>   DW_AT_decl_line   : 458
    <5d9>   DW_AT_decl_column : 18
    <5da>   DW_AT_type        : <0xeb>
    <5de>   DW_AT_data_member_location: 76
 <2><5df>: Abbrev Number: 2 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x57e67): MMFR
    <5e4>   DW_AT_decl_file   : 1
    <5e5>   DW_AT_decl_line   : 459
    <5e7>   DW_AT_decl_column : 18
    <5e8>   DW_AT_type        : <0x65c>
    <5ec>   DW_AT_data_member_location: 80
 <2><5ed>: Abbrev Number: 2 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x68e2b): ISAR
    <5f2>   DW_AT_decl_file   : 1
    <5f3>   DW_AT_decl_line   : 460
    <5f5>   DW_AT_decl_column : 18
    <5f6>   DW_AT_type        : <0x676>
    <5fa>   DW_AT_data_member_location: 96
 <2><5fb>: Abbrev Number: 2 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xcf376): RESERVED0
    <600>   DW_AT_decl_file   : 1
    <601>   DW_AT_decl_line   : 461
    <603>   DW_AT_decl_column : 18
    <604>   DW_AT_type        : <0x67b>
    <608>   DW_AT_data_member_location: 116
 <2><609>: Abbrev Number: 2 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0x59434): CPACR
    <60e>   DW_AT_decl_file   : 1
    <60f>   DW_AT_decl_line   : 462
    <611>   DW_AT_decl_column : 18
    <612>   DW_AT_type        : <0xe6>
    <616>   DW_AT_data_member_location: 136
 <2><617>: Abbrev Number: 0
 <1><618>: Abbrev Number: 8 (DW_TAG_array_type)
    <619>   DW_AT_type        : <0xb8>
    <61d>   DW_AT_sibling     : <0x628>
 <2><621>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <622>   DW_AT_type        : <0x31>
    <626>   DW_AT_upper_bound : 11
 <2><627>: Abbrev Number: 0
 <1><628>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <629>   DW_AT_type        : <0x618>
 <1><62d>: Abbrev Number: 8 (DW_TAG_array_type)
    <62e>   DW_AT_type        : <0xeb>
    <632>   DW_AT_sibling     : <0x63d>
 <2><636>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <637>   DW_AT_type        : <0x31>
    <63b>   DW_AT_upper_bound : 1
 <2><63c>: Abbrev Number: 0
 <1><63d>: Abbrev Number: 15 (DW_TAG_const_type)
    <63e>   DW_AT_type        : <0x62d>
 <1><642>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <643>   DW_AT_type        : <0x63d>
 <1><647>: Abbrev Number: 8 (DW_TAG_array_type)
    <648>   DW_AT_type        : <0xeb>
    <64c>   DW_AT_sibling     : <0x657>
 <2><650>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <651>   DW_AT_type        : <0x31>
    <655>   DW_AT_upper_bound : 3
 <2><656>: Abbrev Number: 0
 <1><657>: Abbrev Number: 15 (DW_TAG_const_type)
    <658>   DW_AT_type        : <0x647>
 <1><65c>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <65d>   DW_AT_type        : <0x657>
 <1><661>: Abbrev Number: 8 (DW_TAG_array_type)
    <662>   DW_AT_type        : <0xeb>
    <666>   DW_AT_sibling     : <0x671>
 <2><66a>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <66b>   DW_AT_type        : <0x31>
    <66f>   DW_AT_upper_bound : 4
 <2><670>: Abbrev Number: 0
 <1><671>: Abbrev Number: 15 (DW_TAG_const_type)
    <672>   DW_AT_type        : <0x661>
 <1><676>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <677>   DW_AT_type        : <0x671>
 <1><67b>: Abbrev Number: 8 (DW_TAG_array_type)
    <67c>   DW_AT_type        : <0xda>
    <680>   DW_AT_sibling     : <0x68b>
 <2><684>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <685>   DW_AT_type        : <0x31>
    <689>   DW_AT_upper_bound : 4
 <2><68a>: Abbrev Number: 0
 <1><68b>: Abbrev Number: 12 (DW_TAG_typedef)
    <68c>   DW_AT_name        : (indirect string, offset: 0xa0f8a): SCB_Type
    <690>   DW_AT_decl_file   : 1
    <691>   DW_AT_decl_line   : 463
    <693>   DW_AT_decl_column : 3
    <694>   DW_AT_type        : <0x4e8>
 <1><698>: Abbrev Number: 8 (DW_TAG_array_type)
    <699>   DW_AT_type        : <0xda>
    <69d>   DW_AT_sibling     : <0x6a8>
 <2><6a1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <6a2>   DW_AT_type        : <0x31>
    <6a6>   DW_AT_upper_bound : 1
 <2><6a7>: Abbrev Number: 0
 <1><6a8>: Abbrev Number: 8 (DW_TAG_array_type)
    <6a9>   DW_AT_type        : <0xbd>
    <6ad>   DW_AT_sibling     : <0x6b8>
 <2><6b1>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <6b2>   DW_AT_type        : <0x31>
    <6b6>   DW_AT_upper_bound : 7
 <2><6b7>: Abbrev Number: 0
 <1><6b8>: Abbrev Number: 15 (DW_TAG_const_type)
    <6b9>   DW_AT_type        : <0x6a8>
 <1><6bd>: Abbrev Number: 16 (DW_TAG_structure_type)
    <6be>   DW_AT_byte_size   : 24
    <6bf>   DW_AT_decl_file   : 12
    <6c0>   DW_AT_decl_line   : 373
    <6c2>   DW_AT_decl_column : 9
    <6c2>   DW_AT_sibling     : <0x71a>
 <2><6c6>: Abbrev Number: 4 (DW_TAG_member)
    <6c7>   DW_AT_name        : CR
    <6ca>   DW_AT_decl_file   : 12
    <6cb>   DW_AT_decl_line   : 375
    <6cd>   DW_AT_decl_column : 17
    <6ce>   DW_AT_type        : <0xe6>
    <6d2>   DW_AT_data_member_location: 0
 <2><6d3>: Abbrev Number: 2 (DW_TAG_member)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x19ace): NDTR
    <6d8>   DW_AT_decl_file   : 12
    <6d9>   DW_AT_decl_line   : 376
    <6db>   DW_AT_decl_column : 17
    <6dc>   DW_AT_type        : <0xe6>
    <6e0>   DW_AT_data_member_location: 4
 <2><6e1>: Abbrev Number: 4 (DW_TAG_member)
    <6e2>   DW_AT_name        : PAR
    <6e6>   DW_AT_decl_file   : 12
    <6e7>   DW_AT_decl_line   : 377
    <6e9>   DW_AT_decl_column : 17
    <6ea>   DW_AT_type        : <0xe6>
    <6ee>   DW_AT_data_member_location: 8
 <2><6ef>: Abbrev Number: 2 (DW_TAG_member)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x5ae33): M0AR
    <6f4>   DW_AT_decl_file   : 12
    <6f5>   DW_AT_decl_line   : 378
    <6f7>   DW_AT_decl_column : 17
    <6f8>   DW_AT_type        : <0xe6>
    <6fc>   DW_AT_data_member_location: 12
 <2><6fd>: Abbrev Number: 2 (DW_TAG_member)
    <6fe>   DW_AT_name        : (indirect string, offset: 0x78c07): M1AR
    <702>   DW_AT_decl_file   : 12
    <703>   DW_AT_decl_line   : 379
    <705>   DW_AT_decl_column : 17
    <706>   DW_AT_type        : <0xe6>
    <70a>   DW_AT_data_member_location: 16
 <2><70b>: Abbrev Number: 4 (DW_TAG_member)
    <70c>   DW_AT_name        : FCR
    <710>   DW_AT_decl_file   : 12
    <711>   DW_AT_decl_line   : 380
    <713>   DW_AT_decl_column : 17
    <714>   DW_AT_type        : <0xe6>
    <718>   DW_AT_data_member_location: 20
 <2><719>: Abbrev Number: 0
 <1><71a>: Abbrev Number: 12 (DW_TAG_typedef)
    <71b>   DW_AT_name        : (indirect string, offset: 0x1a9e2): DMA_Stream_TypeDef
    <71f>   DW_AT_decl_file   : 12
    <720>   DW_AT_decl_line   : 381
    <722>   DW_AT_decl_column : 3
    <723>   DW_AT_type        : <0x6bd>
 <1><727>: Abbrev Number: 16 (DW_TAG_structure_type)
    <728>   DW_AT_byte_size   : 28
    <729>   DW_AT_decl_file   : 12
    <72a>   DW_AT_decl_line   : 409
    <72c>   DW_AT_decl_column : 9
    <72c>   DW_AT_sibling     : <0x791>
 <2><730>: Abbrev Number: 4 (DW_TAG_member)
    <731>   DW_AT_name        : ACR
    <735>   DW_AT_decl_file   : 12
    <736>   DW_AT_decl_line   : 411
    <738>   DW_AT_decl_column : 17
    <739>   DW_AT_type        : <0xe6>
    <73d>   DW_AT_data_member_location: 0
 <2><73e>: Abbrev Number: 2 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0xd87ef): KEYR
    <743>   DW_AT_decl_file   : 12
    <744>   DW_AT_decl_line   : 412
    <746>   DW_AT_decl_column : 17
    <747>   DW_AT_type        : <0xe6>
    <74b>   DW_AT_data_member_location: 4
 <2><74c>: Abbrev Number: 2 (DW_TAG_member)
    <74d>   DW_AT_name        : (indirect string, offset: 0xd87ec): OPTKEYR
    <751>   DW_AT_decl_file   : 12
    <752>   DW_AT_decl_line   : 413
    <754>   DW_AT_decl_column : 17
    <755>   DW_AT_type        : <0xe6>
    <759>   DW_AT_data_member_location: 8
 <2><75a>: Abbrev Number: 4 (DW_TAG_member)
    <75b>   DW_AT_name        : SR
    <75e>   DW_AT_decl_file   : 12
    <75f>   DW_AT_decl_line   : 414
    <761>   DW_AT_decl_column : 17
    <762>   DW_AT_type        : <0xe6>
    <766>   DW_AT_data_member_location: 12
 <2><767>: Abbrev Number: 4 (DW_TAG_member)
    <768>   DW_AT_name        : CR
    <76b>   DW_AT_decl_file   : 12
    <76c>   DW_AT_decl_line   : 415
    <76e>   DW_AT_decl_column : 17
    <76f>   DW_AT_type        : <0xe6>
    <773>   DW_AT_data_member_location: 16
 <2><774>: Abbrev Number: 2 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x43ae): OPTCR
    <779>   DW_AT_decl_file   : 12
    <77a>   DW_AT_decl_line   : 416
    <77c>   DW_AT_decl_column : 17
    <77d>   DW_AT_type        : <0xe6>
    <781>   DW_AT_data_member_location: 20
 <2><782>: Abbrev Number: 2 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0xdb159): OPTCR1
    <787>   DW_AT_decl_file   : 12
    <788>   DW_AT_decl_line   : 417
    <78a>   DW_AT_decl_column : 17
    <78b>   DW_AT_type        : <0xe6>
    <78f>   DW_AT_data_member_location: 24
 <2><790>: Abbrev Number: 0
 <1><791>: Abbrev Number: 12 (DW_TAG_typedef)
    <792>   DW_AT_name        : (indirect string, offset: 0x8dc62): FLASH_TypeDef
    <796>   DW_AT_decl_file   : 12
    <797>   DW_AT_decl_line   : 418
    <799>   DW_AT_decl_column : 3
    <79a>   DW_AT_type        : <0x727>
 <1><79e>: Abbrev Number: 16 (DW_TAG_structure_type)
    <79f>   DW_AT_byte_size   : 8
    <7a0>   DW_AT_decl_file   : 12
    <7a1>   DW_AT_decl_line   : 527
    <7a3>   DW_AT_decl_column : 9
    <7a3>   DW_AT_sibling     : <0x7c3>
 <2><7a7>: Abbrev Number: 4 (DW_TAG_member)
    <7a8>   DW_AT_name        : CR
    <7ab>   DW_AT_decl_file   : 12
    <7ac>   DW_AT_decl_line   : 529
    <7ae>   DW_AT_decl_column : 17
    <7af>   DW_AT_type        : <0xe6>
    <7b3>   DW_AT_data_member_location: 0
 <2><7b4>: Abbrev Number: 4 (DW_TAG_member)
    <7b5>   DW_AT_name        : CSR
    <7b9>   DW_AT_decl_file   : 12
    <7ba>   DW_AT_decl_line   : 530
    <7bc>   DW_AT_decl_column : 17
    <7bd>   DW_AT_type        : <0xe6>
    <7c1>   DW_AT_data_member_location: 4
 <2><7c2>: Abbrev Number: 0
 <1><7c3>: Abbrev Number: 12 (DW_TAG_typedef)
    <7c4>   DW_AT_name        : (indirect string, offset: 0x9de86): PWR_TypeDef
    <7c8>   DW_AT_decl_file   : 12
    <7c9>   DW_AT_decl_line   : 531
    <7cb>   DW_AT_decl_column : 3
    <7cc>   DW_AT_type        : <0x79e>
 <1><7d0>: Abbrev Number: 16 (DW_TAG_structure_type)
    <7d1>   DW_AT_byte_size   : 152
    <7d2>   DW_AT_decl_file   : 12
    <7d3>   DW_AT_decl_line   : 537
    <7d5>   DW_AT_decl_column : 9
    <7d5>   DW_AT_sibling     : <0x9b5>
 <2><7d9>: Abbrev Number: 4 (DW_TAG_member)
    <7da>   DW_AT_name        : CR
    <7dd>   DW_AT_decl_file   : 12
    <7de>   DW_AT_decl_line   : 539
    <7e0>   DW_AT_decl_column : 17
    <7e1>   DW_AT_type        : <0xe6>
    <7e5>   DW_AT_data_member_location: 0
 <2><7e6>: Abbrev Number: 2 (DW_TAG_member)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x98dc9): PLLCFGR
    <7eb>   DW_AT_decl_file   : 12
    <7ec>   DW_AT_decl_line   : 540
    <7ee>   DW_AT_decl_column : 17
    <7ef>   DW_AT_type        : <0xe6>
    <7f3>   DW_AT_data_member_location: 4
 <2><7f4>: Abbrev Number: 2 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x5f752): CFGR
    <7f9>   DW_AT_decl_file   : 12
    <7fa>   DW_AT_decl_line   : 541
    <7fc>   DW_AT_decl_column : 17
    <7fd>   DW_AT_type        : <0xe6>
    <801>   DW_AT_data_member_location: 8
 <2><802>: Abbrev Number: 4 (DW_TAG_member)
    <803>   DW_AT_name        : CIR
    <807>   DW_AT_decl_file   : 12
    <808>   DW_AT_decl_line   : 542
    <80a>   DW_AT_decl_column : 17
    <80b>   DW_AT_type        : <0xe6>
    <80f>   DW_AT_data_member_location: 12
 <2><810>: Abbrev Number: 2 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0xae467): AHB1RSTR
    <815>   DW_AT_decl_file   : 12
    <816>   DW_AT_decl_line   : 543
    <818>   DW_AT_decl_column : 17
    <819>   DW_AT_type        : <0xe6>
    <81d>   DW_AT_data_member_location: 16
 <2><81e>: Abbrev Number: 2 (DW_TAG_member)
    <81f>   DW_AT_name        : (indirect string, offset: 0x8e006): AHB2RSTR
    <823>   DW_AT_decl_file   : 12
    <824>   DW_AT_decl_line   : 544
    <826>   DW_AT_decl_column : 17
    <827>   DW_AT_type        : <0xe6>
    <82b>   DW_AT_data_member_location: 20
 <2><82c>: Abbrev Number: 2 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x5f5b8): AHB3RSTR
    <831>   DW_AT_decl_file   : 12
    <832>   DW_AT_decl_line   : 545
    <834>   DW_AT_decl_column : 17
    <835>   DW_AT_type        : <0xe6>
    <839>   DW_AT_data_member_location: 24
 <2><83a>: Abbrev Number: 2 (DW_TAG_member)
    <83b>   DW_AT_name        : (indirect string, offset: 0xcf376): RESERVED0
    <83f>   DW_AT_decl_file   : 12
    <840>   DW_AT_decl_line   : 546
    <842>   DW_AT_decl_column : 17
    <843>   DW_AT_type        : <0xda>
    <847>   DW_AT_data_member_location: 28
 <2><848>: Abbrev Number: 2 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0x18d09): APB1RSTR
    <84d>   DW_AT_decl_file   : 12
    <84e>   DW_AT_decl_line   : 547
    <850>   DW_AT_decl_column : 17
    <851>   DW_AT_type        : <0xe6>
    <855>   DW_AT_data_member_location: 32
 <2><856>: Abbrev Number: 2 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0x5f08a): APB2RSTR
    <85b>   DW_AT_decl_file   : 12
    <85c>   DW_AT_decl_line   : 548
    <85e>   DW_AT_decl_column : 17
    <85f>   DW_AT_type        : <0xe6>
    <863>   DW_AT_data_member_location: 36
 <2><864>: Abbrev Number: 2 (DW_TAG_member)
    <865>   DW_AT_name        : (indirect string, offset: 0xcf380): RESERVED1
    <869>   DW_AT_decl_file   : 12
    <86a>   DW_AT_decl_line   : 549
    <86c>   DW_AT_decl_column : 17
    <86d>   DW_AT_type        : <0x698>
    <871>   DW_AT_data_member_location: 40
 <2><872>: Abbrev Number: 2 (DW_TAG_member)
    <873>   DW_AT_name        : (indirect string, offset: 0x1204c): AHB1ENR
    <877>   DW_AT_decl_file   : 12
    <878>   DW_AT_decl_line   : 550
    <87a>   DW_AT_decl_column : 17
    <87b>   DW_AT_type        : <0xe6>
    <87f>   DW_AT_data_member_location: 48
 <2><880>: Abbrev Number: 2 (DW_TAG_member)
    <881>   DW_AT_name        : (indirect string, offset: 0x3a0aa): AHB2ENR
    <885>   DW_AT_decl_file   : 12
    <886>   DW_AT_decl_line   : 551
    <888>   DW_AT_decl_column : 17
    <889>   DW_AT_type        : <0xe6>
    <88d>   DW_AT_data_member_location: 52
 <2><88e>: Abbrev Number: 2 (DW_TAG_member)
    <88f>   DW_AT_name        : (indirect string, offset: 0x62795): AHB3ENR
    <893>   DW_AT_decl_file   : 12
    <894>   DW_AT_decl_line   : 552
    <896>   DW_AT_decl_column : 17
    <897>   DW_AT_type        : <0xe6>
    <89b>   DW_AT_data_member_location: 56
 <2><89c>: Abbrev Number: 2 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0xcf38a): RESERVED2
    <8a1>   DW_AT_decl_file   : 12
    <8a2>   DW_AT_decl_line   : 553
    <8a4>   DW_AT_decl_column : 17
    <8a5>   DW_AT_type        : <0xda>
    <8a9>   DW_AT_data_member_location: 60
 <2><8aa>: Abbrev Number: 2 (DW_TAG_member)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x7d390): APB1ENR
    <8af>   DW_AT_decl_file   : 12
    <8b0>   DW_AT_decl_line   : 554
    <8b2>   DW_AT_decl_column : 17
    <8b3>   DW_AT_type        : <0xe6>
    <8b7>   DW_AT_data_member_location: 64
 <2><8b8>: Abbrev Number: 2 (DW_TAG_member)
    <8b9>   DW_AT_name        : (indirect string, offset: 0x69de6): APB2ENR
    <8bd>   DW_AT_decl_file   : 12
    <8be>   DW_AT_decl_line   : 555
    <8c0>   DW_AT_decl_column : 17
    <8c1>   DW_AT_type        : <0xe6>
    <8c5>   DW_AT_data_member_location: 68
 <2><8c6>: Abbrev Number: 2 (DW_TAG_member)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xcf394): RESERVED3
    <8cb>   DW_AT_decl_file   : 12
    <8cc>   DW_AT_decl_line   : 556
    <8ce>   DW_AT_decl_column : 17
    <8cf>   DW_AT_type        : <0x698>
    <8d3>   DW_AT_data_member_location: 72
 <2><8d4>: Abbrev Number: 2 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0xb2d0f): AHB1LPENR
    <8d9>   DW_AT_decl_file   : 12
    <8da>   DW_AT_decl_line   : 557
    <8dc>   DW_AT_decl_column : 17
    <8dd>   DW_AT_type        : <0xe6>
    <8e1>   DW_AT_data_member_location: 80
 <2><8e2>: Abbrev Number: 2 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x311f0): AHB2LPENR
    <8e7>   DW_AT_decl_file   : 12
    <8e8>   DW_AT_decl_line   : 558
    <8ea>   DW_AT_decl_column : 17
    <8eb>   DW_AT_type        : <0xe6>
    <8ef>   DW_AT_data_member_location: 84
 <2><8f0>: Abbrev Number: 2 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x939f0): AHB3LPENR
    <8f5>   DW_AT_decl_file   : 12
    <8f6>   DW_AT_decl_line   : 559
    <8f8>   DW_AT_decl_column : 17
    <8f9>   DW_AT_type        : <0xe6>
    <8fd>   DW_AT_data_member_location: 88
 <2><8fe>: Abbrev Number: 2 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0xcf39e): RESERVED4
    <903>   DW_AT_decl_file   : 12
    <904>   DW_AT_decl_line   : 560
    <906>   DW_AT_decl_column : 17
    <907>   DW_AT_type        : <0xda>
    <90b>   DW_AT_data_member_location: 92
 <2><90c>: Abbrev Number: 2 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0xb7d1e): APB1LPENR
    <911>   DW_AT_decl_file   : 12
    <912>   DW_AT_decl_line   : 561
    <914>   DW_AT_decl_column : 17
    <915>   DW_AT_type        : <0xe6>
    <919>   DW_AT_data_member_location: 96
 <2><91a>: Abbrev Number: 2 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x2470e): APB2LPENR
    <91f>   DW_AT_decl_file   : 12
    <920>   DW_AT_decl_line   : 562
    <922>   DW_AT_decl_column : 17
    <923>   DW_AT_type        : <0xe6>
    <927>   DW_AT_data_member_location: 100
 <2><928>: Abbrev Number: 2 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0xcf3a8): RESERVED5
    <92d>   DW_AT_decl_file   : 12
    <92e>   DW_AT_decl_line   : 563
    <930>   DW_AT_decl_column : 17
    <931>   DW_AT_type        : <0x698>
    <935>   DW_AT_data_member_location: 104
 <2><936>: Abbrev Number: 2 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x1e9a1): BDCR
    <93b>   DW_AT_decl_file   : 12
    <93c>   DW_AT_decl_line   : 564
    <93e>   DW_AT_decl_column : 17
    <93f>   DW_AT_type        : <0xe6>
    <943>   DW_AT_data_member_location: 112
 <2><944>: Abbrev Number: 4 (DW_TAG_member)
    <945>   DW_AT_name        : CSR
    <949>   DW_AT_decl_file   : 12
    <94a>   DW_AT_decl_line   : 565
    <94c>   DW_AT_decl_column : 17
    <94d>   DW_AT_type        : <0xe6>
    <951>   DW_AT_data_member_location: 116
 <2><952>: Abbrev Number: 2 (DW_TAG_member)
    <953>   DW_AT_name        : (indirect string, offset: 0x8207b): RESERVED6
    <957>   DW_AT_decl_file   : 12
    <958>   DW_AT_decl_line   : 566
    <95a>   DW_AT_decl_column : 17
    <95b>   DW_AT_type        : <0x698>
    <95f>   DW_AT_data_member_location: 120
 <2><960>: Abbrev Number: 2 (DW_TAG_member)
    <961>   DW_AT_name        : (indirect string, offset: 0x73d3c): SSCGR
    <965>   DW_AT_decl_file   : 12
    <966>   DW_AT_decl_line   : 567
    <968>   DW_AT_decl_column : 17
    <969>   DW_AT_type        : <0xe6>
    <96d>   DW_AT_data_member_location: 128
 <2><96e>: Abbrev Number: 2 (DW_TAG_member)
    <96f>   DW_AT_name        : (indirect string, offset: 0x4898d): PLLI2SCFGR
    <973>   DW_AT_decl_file   : 12
    <974>   DW_AT_decl_line   : 568
    <976>   DW_AT_decl_column : 17
    <977>   DW_AT_type        : <0xe6>
    <97b>   DW_AT_data_member_location: 132
 <2><97c>: Abbrev Number: 2 (DW_TAG_member)
    <97d>   DW_AT_name        : (indirect string, offset: 0xcf3e3): RESERVED7
    <981>   DW_AT_decl_file   : 12
    <982>   DW_AT_decl_line   : 569
    <984>   DW_AT_decl_column : 17
    <985>   DW_AT_type        : <0xda>
    <989>   DW_AT_data_member_location: 136
 <2><98a>: Abbrev Number: 2 (DW_TAG_member)
    <98b>   DW_AT_name        : (indirect string, offset: 0x5f74f): DCKCFGR
    <98f>   DW_AT_decl_file   : 12
    <990>   DW_AT_decl_line   : 570
    <992>   DW_AT_decl_column : 17
    <993>   DW_AT_type        : <0xe6>
    <997>   DW_AT_data_member_location: 140
 <2><998>: Abbrev Number: 2 (DW_TAG_member)
    <999>   DW_AT_name        : (indirect string, offset: 0xa7ea1): CKGATENR
    <99d>   DW_AT_decl_file   : 12
    <99e>   DW_AT_decl_line   : 571
    <9a0>   DW_AT_decl_column : 17
    <9a1>   DW_AT_type        : <0xe6>
    <9a5>   DW_AT_data_member_location: 144
 <2><9a6>: Abbrev Number: 2 (DW_TAG_member)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x97650): DCKCFGR2
    <9ab>   DW_AT_decl_file   : 12
    <9ac>   DW_AT_decl_line   : 572
    <9ae>   DW_AT_decl_column : 17
    <9af>   DW_AT_type        : <0xe6>
    <9b3>   DW_AT_data_member_location: 148
 <2><9b4>: Abbrev Number: 0
 <1><9b5>: Abbrev Number: 12 (DW_TAG_typedef)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x65a01): RCC_TypeDef
    <9ba>   DW_AT_decl_file   : 12
    <9bb>   DW_AT_decl_line   : 573
    <9bd>   DW_AT_decl_column : 3
    <9be>   DW_AT_type        : <0x7d0>
 <1><9c2>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9c3>   DW_AT_byte_size   : 84
    <9c4>   DW_AT_decl_file   : 12
    <9c5>   DW_AT_decl_line   : 714
    <9c7>   DW_AT_decl_column : 9
    <9c7>   DW_AT_sibling     : <0xaf0>
 <2><9cb>: Abbrev Number: 4 (DW_TAG_member)
    <9cc>   DW_AT_name        : CR1
    <9d0>   DW_AT_decl_file   : 12
    <9d1>   DW_AT_decl_line   : 716
    <9d3>   DW_AT_decl_column : 17
    <9d4>   DW_AT_type        : <0xe6>
    <9d8>   DW_AT_data_member_location: 0
 <2><9d9>: Abbrev Number: 4 (DW_TAG_member)
    <9da>   DW_AT_name        : CR2
    <9de>   DW_AT_decl_file   : 12
    <9df>   DW_AT_decl_line   : 717
    <9e1>   DW_AT_decl_column : 17
    <9e2>   DW_AT_type        : <0xe6>
    <9e6>   DW_AT_data_member_location: 4
 <2><9e7>: Abbrev Number: 2 (DW_TAG_member)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x3fe38): SMCR
    <9ec>   DW_AT_decl_file   : 12
    <9ed>   DW_AT_decl_line   : 718
    <9ef>   DW_AT_decl_column : 17
    <9f0>   DW_AT_type        : <0xe6>
    <9f4>   DW_AT_data_member_location: 8
 <2><9f5>: Abbrev Number: 2 (DW_TAG_member)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x481e3): DIER
    <9fa>   DW_AT_decl_file   : 12
    <9fb>   DW_AT_decl_line   : 719
    <9fd>   DW_AT_decl_column : 17
    <9fe>   DW_AT_type        : <0xe6>
    <a02>   DW_AT_data_member_location: 12
 <2><a03>: Abbrev Number: 4 (DW_TAG_member)
    <a04>   DW_AT_name        : SR
    <a07>   DW_AT_decl_file   : 12
    <a08>   DW_AT_decl_line   : 720
    <a0a>   DW_AT_decl_column : 17
    <a0b>   DW_AT_type        : <0xe6>
    <a0f>   DW_AT_data_member_location: 16
 <2><a10>: Abbrev Number: 4 (DW_TAG_member)
    <a11>   DW_AT_name        : EGR
    <a15>   DW_AT_decl_file   : 12
    <a16>   DW_AT_decl_line   : 721
    <a18>   DW_AT_decl_column : 17
    <a19>   DW_AT_type        : <0xe6>
    <a1d>   DW_AT_data_member_location: 20
 <2><a1e>: Abbrev Number: 2 (DW_TAG_member)
    <a1f>   DW_AT_name        : (indirect string, offset: 0xc813e): CCMR1
    <a23>   DW_AT_decl_file   : 12
    <a24>   DW_AT_decl_line   : 722
    <a26>   DW_AT_decl_column : 17
    <a27>   DW_AT_type        : <0xe6>
    <a2b>   DW_AT_data_member_location: 24
 <2><a2c>: Abbrev Number: 2 (DW_TAG_member)
    <a2d>   DW_AT_name        : (indirect string, offset: 0x5768d): CCMR2
    <a31>   DW_AT_decl_file   : 12
    <a32>   DW_AT_decl_line   : 723
    <a34>   DW_AT_decl_column : 17
    <a35>   DW_AT_type        : <0xe6>
    <a39>   DW_AT_data_member_location: 28
 <2><a3a>: Abbrev Number: 2 (DW_TAG_member)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x35378): CCER
    <a3f>   DW_AT_decl_file   : 12
    <a40>   DW_AT_decl_line   : 724
    <a42>   DW_AT_decl_column : 17
    <a43>   DW_AT_type        : <0xe6>
    <a47>   DW_AT_data_member_location: 32
 <2><a48>: Abbrev Number: 4 (DW_TAG_member)
    <a49>   DW_AT_name        : CNT
    <a4d>   DW_AT_decl_file   : 12
    <a4e>   DW_AT_decl_line   : 725
    <a50>   DW_AT_decl_column : 17
    <a51>   DW_AT_type        : <0xe6>
    <a55>   DW_AT_data_member_location: 36
 <2><a56>: Abbrev Number: 4 (DW_TAG_member)
    <a57>   DW_AT_name        : PSC
    <a5b>   DW_AT_decl_file   : 12
    <a5c>   DW_AT_decl_line   : 726
    <a5e>   DW_AT_decl_column : 17
    <a5f>   DW_AT_type        : <0xe6>
    <a63>   DW_AT_data_member_location: 40
 <2><a64>: Abbrev Number: 4 (DW_TAG_member)
    <a65>   DW_AT_name        : ARR
    <a69>   DW_AT_decl_file   : 12
    <a6a>   DW_AT_decl_line   : 727
    <a6c>   DW_AT_decl_column : 17
    <a6d>   DW_AT_type        : <0xe6>
    <a71>   DW_AT_data_member_location: 44
 <2><a72>: Abbrev Number: 4 (DW_TAG_member)
    <a73>   DW_AT_name        : RCR
    <a77>   DW_AT_decl_file   : 12
    <a78>   DW_AT_decl_line   : 728
    <a7a>   DW_AT_decl_column : 17
    <a7b>   DW_AT_type        : <0xe6>
    <a7f>   DW_AT_data_member_location: 48
 <2><a80>: Abbrev Number: 2 (DW_TAG_member)
    <a81>   DW_AT_name        : (indirect string, offset: 0x1a333): CCR1
    <a85>   DW_AT_decl_file   : 12
    <a86>   DW_AT_decl_line   : 729
    <a88>   DW_AT_decl_column : 17
    <a89>   DW_AT_type        : <0xe6>
    <a8d>   DW_AT_data_member_location: 52
 <2><a8e>: Abbrev Number: 2 (DW_TAG_member)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x5bb5f): CCR2
    <a93>   DW_AT_decl_file   : 12
    <a94>   DW_AT_decl_line   : 730
    <a96>   DW_AT_decl_column : 17
    <a97>   DW_AT_type        : <0xe6>
    <a9b>   DW_AT_data_member_location: 56
 <2><a9c>: Abbrev Number: 2 (DW_TAG_member)
    <a9d>   DW_AT_name        : (indirect string, offset: 0xa702e): CCR3
    <aa1>   DW_AT_decl_file   : 12
    <aa2>   DW_AT_decl_line   : 731
    <aa4>   DW_AT_decl_column : 17
    <aa5>   DW_AT_type        : <0xe6>
    <aa9>   DW_AT_data_member_location: 60
 <2><aaa>: Abbrev Number: 2 (DW_TAG_member)
    <aab>   DW_AT_name        : (indirect string, offset: 0xdd57): CCR4
    <aaf>   DW_AT_decl_file   : 12
    <ab0>   DW_AT_decl_line   : 732
    <ab2>   DW_AT_decl_column : 17
    <ab3>   DW_AT_type        : <0xe6>
    <ab7>   DW_AT_data_member_location: 64
 <2><ab8>: Abbrev Number: 2 (DW_TAG_member)
    <ab9>   DW_AT_name        : (indirect string, offset: 0x5c9f1): BDTR
    <abd>   DW_AT_decl_file   : 12
    <abe>   DW_AT_decl_line   : 733
    <ac0>   DW_AT_decl_column : 17
    <ac1>   DW_AT_type        : <0xe6>
    <ac5>   DW_AT_data_member_location: 68
 <2><ac6>: Abbrev Number: 4 (DW_TAG_member)
    <ac7>   DW_AT_name        : DCR
    <acb>   DW_AT_decl_file   : 12
    <acc>   DW_AT_decl_line   : 734
    <ace>   DW_AT_decl_column : 17
    <acf>   DW_AT_type        : <0xe6>
    <ad3>   DW_AT_data_member_location: 72
 <2><ad4>: Abbrev Number: 2 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0xbc070): DMAR
    <ad9>   DW_AT_decl_file   : 12
    <ada>   DW_AT_decl_line   : 735
    <adc>   DW_AT_decl_column : 17
    <add>   DW_AT_type        : <0xe6>
    <ae1>   DW_AT_data_member_location: 76
 <2><ae2>: Abbrev Number: 4 (DW_TAG_member)
    <ae3>   DW_AT_name        : OR
    <ae6>   DW_AT_decl_file   : 12
    <ae7>   DW_AT_decl_line   : 736
    <ae9>   DW_AT_decl_column : 17
    <aea>   DW_AT_type        : <0xe6>
    <aee>   DW_AT_data_member_location: 80
 <2><aef>: Abbrev Number: 0
 <1><af0>: Abbrev Number: 12 (DW_TAG_typedef)
    <af1>   DW_AT_name        : (indirect string, offset: 0xdecf7): TIM_TypeDef
    <af5>   DW_AT_decl_file   : 12
    <af6>   DW_AT_decl_line   : 737
    <af8>   DW_AT_decl_column : 3
    <af9>   DW_AT_type        : <0x9c2>
 <1><afd>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <afe>   DW_AT_encoding    : 7	(unsigned)
    <aff>   DW_AT_byte_size   : 1
    <b00>   DW_AT_type        : <0x59>
    <b04>   DW_AT_decl_file   : 13
    <b05>   DW_AT_decl_line   : 198
    <b06>   DW_AT_decl_column : 1
    <b07>   DW_AT_sibling     : <0xb18>
 <2><b0b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b0c>   DW_AT_name        : (indirect string, offset: 0xce100): SUCCESS
    <b10>   DW_AT_const_value : 0
 <2><b11>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b12>   DW_AT_name        : (indirect string, offset: 0xbb60f): ERROR
    <b16>   DW_AT_const_value : 1
 <2><b17>: Abbrev Number: 0
 <1><b18>: Abbrev Number: 6 (DW_TAG_typedef)
    <b19>   DW_AT_name        : (indirect string, offset: 0x941f1): ErrorStatus
    <b1d>   DW_AT_decl_file   : 13
    <b1e>   DW_AT_decl_line   : 201
    <b1f>   DW_AT_decl_column : 3
    <b20>   DW_AT_type        : <0xafd>
 <1><b24>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <b25>   DW_AT_encoding    : 7	(unsigned)
    <b26>   DW_AT_byte_size   : 1
    <b27>   DW_AT_type        : <0x59>
    <b2b>   DW_AT_decl_file   : 14
    <b2c>   DW_AT_decl_line   : 39
    <b2d>   DW_AT_decl_column : 1
    <b2e>   DW_AT_sibling     : <0xb4b>
 <2><b32>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b33>   DW_AT_name        : (indirect string, offset: 0x49c46): HAL_OK
    <b37>   DW_AT_const_value : 0
 <2><b38>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b39>   DW_AT_name        : (indirect string, offset: 0x88910): HAL_ERROR
    <b3d>   DW_AT_const_value : 1
 <2><b3e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x26b73): HAL_BUSY
    <b43>   DW_AT_const_value : 2
 <2><b44>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b45>   DW_AT_name        : (indirect string, offset: 0x3fd64): HAL_TIMEOUT
    <b49>   DW_AT_const_value : 3
 <2><b4a>: Abbrev Number: 0
 <1><b4b>: Abbrev Number: 6 (DW_TAG_typedef)
    <b4c>   DW_AT_name        : (indirect string, offset: 0x275c): HAL_StatusTypeDef
    <b50>   DW_AT_decl_file   : 14
    <b51>   DW_AT_decl_line   : 44
    <b52>   DW_AT_decl_column : 3
    <b53>   DW_AT_type        : <0xb24>
 <1><b57>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <b58>   DW_AT_encoding    : 7	(unsigned)
    <b59>   DW_AT_byte_size   : 1
    <b5a>   DW_AT_type        : <0x59>
    <b5e>   DW_AT_decl_file   : 14
    <b5f>   DW_AT_decl_line   : 50
    <b60>   DW_AT_decl_column : 1
    <b61>   DW_AT_sibling     : <0xb72>
 <2><b65>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b66>   DW_AT_name        : (indirect string, offset: 0xa1a26): HAL_UNLOCKED
    <b6a>   DW_AT_const_value : 0
 <2><b6b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b6c>   DW_AT_name        : (indirect string, offset: 0xdbfba): HAL_LOCKED
    <b70>   DW_AT_const_value : 1
 <2><b71>: Abbrev Number: 0
 <1><b72>: Abbrev Number: 6 (DW_TAG_typedef)
    <b73>   DW_AT_name        : (indirect string, offset: 0x810a3): HAL_LockTypeDef
    <b77>   DW_AT_decl_file   : 14
    <b78>   DW_AT_decl_line   : 53
    <b79>   DW_AT_decl_column : 3
    <b7a>   DW_AT_type        : <0xb57>
 <1><b7e>: Abbrev Number: 24 (DW_TAG_structure_type)
    <b7f>   DW_AT_byte_size   : 48
    <b80>   DW_AT_decl_file   : 15
    <b81>   DW_AT_decl_line   : 48
    <b82>   DW_AT_decl_column : 9
    <b82>   DW_AT_sibling     : <0xc23>
 <2><b86>: Abbrev Number: 3 (DW_TAG_member)
    <b87>   DW_AT_name        : (indirect string, offset: 0x71b58): Channel
    <b8b>   DW_AT_decl_file   : 15
    <b8c>   DW_AT_decl_line   : 50
    <b8d>   DW_AT_decl_column : 12
    <b8e>   DW_AT_type        : <0xda>
    <b92>   DW_AT_data_member_location: 0
 <2><b93>: Abbrev Number: 3 (DW_TAG_member)
    <b94>   DW_AT_name        : (indirect string, offset: 0x51244): Direction
    <b98>   DW_AT_decl_file   : 15
    <b99>   DW_AT_decl_line   : 53
    <b9a>   DW_AT_decl_column : 12
    <b9b>   DW_AT_type        : <0xda>
    <b9f>   DW_AT_data_member_location: 4
 <2><ba0>: Abbrev Number: 3 (DW_TAG_member)
    <ba1>   DW_AT_name        : (indirect string, offset: 0xeb08): PeriphInc
    <ba5>   DW_AT_decl_file   : 15
    <ba6>   DW_AT_decl_line   : 57
    <ba7>   DW_AT_decl_column : 12
    <ba8>   DW_AT_type        : <0xda>
    <bac>   DW_AT_data_member_location: 8
 <2><bad>: Abbrev Number: 3 (DW_TAG_member)
    <bae>   DW_AT_name        : (indirect string, offset: 0x22bfa): MemInc
    <bb2>   DW_AT_decl_file   : 15
    <bb3>   DW_AT_decl_line   : 60
    <bb4>   DW_AT_decl_column : 12
    <bb5>   DW_AT_type        : <0xda>
    <bb9>   DW_AT_data_member_location: 12
 <2><bba>: Abbrev Number: 3 (DW_TAG_member)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x6cc95): PeriphDataAlignment
    <bbf>   DW_AT_decl_file   : 15
    <bc0>   DW_AT_decl_line   : 63
    <bc1>   DW_AT_decl_column : 12
    <bc2>   DW_AT_type        : <0xda>
    <bc6>   DW_AT_data_member_location: 16
 <2><bc7>: Abbrev Number: 3 (DW_TAG_member)
    <bc8>   DW_AT_name        : (indirect string, offset: 0xc5f68): MemDataAlignment
    <bcc>   DW_AT_decl_file   : 15
    <bcd>   DW_AT_decl_line   : 66
    <bce>   DW_AT_decl_column : 12
    <bcf>   DW_AT_type        : <0xda>
    <bd3>   DW_AT_data_member_location: 20
 <2><bd4>: Abbrev Number: 3 (DW_TAG_member)
    <bd5>   DW_AT_name        : (indirect string, offset: 0xde371): Mode
    <bd9>   DW_AT_decl_file   : 15
    <bda>   DW_AT_decl_line   : 69
    <bdb>   DW_AT_decl_column : 12
    <bdc>   DW_AT_type        : <0xda>
    <be0>   DW_AT_data_member_location: 24
 <2><be1>: Abbrev Number: 3 (DW_TAG_member)
    <be2>   DW_AT_name        : (indirect string, offset: 0xdd8cf): Priority
    <be6>   DW_AT_decl_file   : 15
    <be7>   DW_AT_decl_line   : 74
    <be8>   DW_AT_decl_column : 12
    <be9>   DW_AT_type        : <0xda>
    <bed>   DW_AT_data_member_location: 28
 <2><bee>: Abbrev Number: 3 (DW_TAG_member)
    <bef>   DW_AT_name        : (indirect string, offset: 0x5e812): FIFOMode
    <bf3>   DW_AT_decl_file   : 15
    <bf4>   DW_AT_decl_line   : 77
    <bf5>   DW_AT_decl_column : 12
    <bf6>   DW_AT_type        : <0xda>
    <bfa>   DW_AT_data_member_location: 32
 <2><bfb>: Abbrev Number: 3 (DW_TAG_member)
    <bfc>   DW_AT_name        : (indirect string, offset: 0xa629a): FIFOThreshold
    <c00>   DW_AT_decl_file   : 15
    <c01>   DW_AT_decl_line   : 82
    <c02>   DW_AT_decl_column : 12
    <c03>   DW_AT_type        : <0xda>
    <c07>   DW_AT_data_member_location: 36
 <2><c08>: Abbrev Number: 3 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0xa41c3): MemBurst
    <c0d>   DW_AT_decl_file   : 15
    <c0e>   DW_AT_decl_line   : 85
    <c0f>   DW_AT_decl_column : 12
    <c10>   DW_AT_type        : <0xda>
    <c14>   DW_AT_data_member_location: 40
 <2><c15>: Abbrev Number: 3 (DW_TAG_member)
    <c16>   DW_AT_name        : (indirect string, offset: 0x4ae82): PeriphBurst
    <c1a>   DW_AT_decl_file   : 15
    <c1b>   DW_AT_decl_line   : 91
    <c1c>   DW_AT_decl_column : 12
    <c1d>   DW_AT_type        : <0xda>
    <c21>   DW_AT_data_member_location: 44
 <2><c22>: Abbrev Number: 0
 <1><c23>: Abbrev Number: 6 (DW_TAG_typedef)
    <c24>   DW_AT_name        : (indirect string, offset: 0x3a9d2): DMA_InitTypeDef
    <c28>   DW_AT_decl_file   : 15
    <c29>   DW_AT_decl_line   : 96
    <c2a>   DW_AT_decl_column : 2
    <c2b>   DW_AT_type        : <0xb7e>
 <1><c2f>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <c30>   DW_AT_encoding    : 7	(unsigned)
    <c31>   DW_AT_byte_size   : 1
    <c32>   DW_AT_type        : <0x59>
    <c36>   DW_AT_decl_file   : 15
    <c37>   DW_AT_decl_line   : 103
    <c38>   DW_AT_decl_column : 1
    <c39>   DW_AT_sibling     : <0xc62>
 <2><c3d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c3e>   DW_AT_name        : (indirect string, offset: 0xa2f67): HAL_DMA_STATE_RESET
    <c42>   DW_AT_const_value : 0
 <2><c43>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c44>   DW_AT_name        : (indirect string, offset: 0x3bece): HAL_DMA_STATE_READY
    <c48>   DW_AT_const_value : 1
 <2><c49>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c4a>   DW_AT_name        : (indirect string, offset: 0x97045): HAL_DMA_STATE_BUSY
    <c4e>   DW_AT_const_value : 2
 <2><c4f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c50>   DW_AT_name        : (indirect string, offset: 0xd8a45): HAL_DMA_STATE_TIMEOUT
    <c54>   DW_AT_const_value : 3
 <2><c55>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c56>   DW_AT_name        : (indirect string, offset: 0xbb601): HAL_DMA_STATE_ERROR
    <c5a>   DW_AT_const_value : 4
 <2><c5b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c5c>   DW_AT_name        : (indirect string, offset: 0x55d85): HAL_DMA_STATE_ABORT
    <c60>   DW_AT_const_value : 5
 <2><c61>: Abbrev Number: 0
 <1><c62>: Abbrev Number: 6 (DW_TAG_typedef)
    <c63>   DW_AT_name        : (indirect string, offset: 0xc52e7): HAL_DMA_StateTypeDef
    <c67>   DW_AT_decl_file   : 15
    <c68>   DW_AT_decl_line   : 110
    <c69>   DW_AT_decl_column : 2
    <c6a>   DW_AT_type        : <0xc2f>
 <1><c6e>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <c6f>   DW_AT_type        : <0xc62>
 <1><c73>: Abbrev Number: 37 (DW_TAG_structure_type)
    <c74>   DW_AT_name        : (indirect string, offset: 0xba5c6): __DMA_HandleTypeDef
    <c78>   DW_AT_byte_size   : 96
    <c79>   DW_AT_decl_file   : 15
    <c7a>   DW_AT_decl_line   : 138
    <c7b>   DW_AT_decl_column : 16
    <c7c>   DW_AT_sibling     : <0xd37>
 <2><c80>: Abbrev Number: 3 (DW_TAG_member)
    <c81>   DW_AT_name        : (indirect string, offset: 0xd46df): Instance
    <c85>   DW_AT_decl_file   : 15
    <c86>   DW_AT_decl_line   : 140
    <c87>   DW_AT_decl_column : 31
    <c88>   DW_AT_type        : <0xd37>
    <c8c>   DW_AT_data_member_location: 0
 <2><c8d>: Abbrev Number: 3 (DW_TAG_member)
    <c8e>   DW_AT_name        : (indirect string, offset: 0xb7025): Init
    <c92>   DW_AT_decl_file   : 15
    <c93>   DW_AT_decl_line   : 142
    <c94>   DW_AT_decl_column : 30
    <c95>   DW_AT_type        : <0xc23>
    <c99>   DW_AT_data_member_location: 4
 <2><c9a>: Abbrev Number: 3 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x9baec): Lock
    <c9f>   DW_AT_decl_file   : 15
    <ca0>   DW_AT_decl_line   : 144
    <ca1>   DW_AT_decl_column : 30
    <ca2>   DW_AT_type        : <0xb72>
    <ca6>   DW_AT_data_member_location: 52
 <2><ca7>: Abbrev Number: 3 (DW_TAG_member)
    <ca8>   DW_AT_name        : (indirect string, offset: 0xdf57e): State
    <cac>   DW_AT_decl_file   : 15
    <cad>   DW_AT_decl_line   : 146
    <cae>   DW_AT_decl_column : 30
    <caf>   DW_AT_type        : <0xc6e>
    <cb3>   DW_AT_data_member_location: 53
 <2><cb4>: Abbrev Number: 3 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0xd0fb6): Parent
    <cb9>   DW_AT_decl_file   : 15
    <cba>   DW_AT_decl_line   : 148
    <cbb>   DW_AT_decl_column : 31
    <cbc>   DW_AT_type        : <0xf0>
    <cc0>   DW_AT_data_member_location: 56
 <2><cc1>: Abbrev Number: 3 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x14145): XferCpltCallback
    <cc6>   DW_AT_decl_file   : 15
    <cc7>   DW_AT_decl_line   : 150
    <cc8>   DW_AT_decl_column : 33
    <cc9>   DW_AT_type        : <0xd4c>
    <ccd>   DW_AT_data_member_location: 60
 <2><cce>: Abbrev Number: 3 (DW_TAG_member)
    <ccf>   DW_AT_name        : (indirect string, offset: 0xa9f3b): XferHalfCpltCallback
    <cd3>   DW_AT_decl_file   : 15
    <cd4>   DW_AT_decl_line   : 152
    <cd5>   DW_AT_decl_column : 33
    <cd6>   DW_AT_type        : <0xd4c>
    <cda>   DW_AT_data_member_location: 64
 <2><cdb>: Abbrev Number: 3 (DW_TAG_member)
    <cdc>   DW_AT_name        : (indirect string, offset: 0xc8bf4): XferM1CpltCallback
    <ce0>   DW_AT_decl_file   : 15
    <ce1>   DW_AT_decl_line   : 154
    <ce2>   DW_AT_decl_column : 33
    <ce3>   DW_AT_type        : <0xd4c>
    <ce7>   DW_AT_data_member_location: 68
 <2><ce8>: Abbrev Number: 3 (DW_TAG_member)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x697c1): XferM1HalfCpltCallback
    <ced>   DW_AT_decl_file   : 15
    <cee>   DW_AT_decl_line   : 156
    <cef>   DW_AT_decl_column : 33
    <cf0>   DW_AT_type        : <0xd4c>
    <cf4>   DW_AT_data_member_location: 72
 <2><cf5>: Abbrev Number: 3 (DW_TAG_member)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x1f842): XferErrorCallback
    <cfa>   DW_AT_decl_file   : 15
    <cfb>   DW_AT_decl_line   : 158
    <cfc>   DW_AT_decl_column : 33
    <cfd>   DW_AT_type        : <0xd4c>
    <d01>   DW_AT_data_member_location: 76
 <2><d02>: Abbrev Number: 3 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0xcd1d4): XferAbortCallback
    <d07>   DW_AT_decl_file   : 15
    <d08>   DW_AT_decl_line   : 160
    <d09>   DW_AT_decl_column : 33
    <d0a>   DW_AT_type        : <0xd4c>
    <d0e>   DW_AT_data_member_location: 80
 <2><d0f>: Abbrev Number: 3 (DW_TAG_member)
    <d10>   DW_AT_name        : (indirect string, offset: 0xd6d5a): ErrorCode
    <d14>   DW_AT_decl_file   : 15
    <d15>   DW_AT_decl_line   : 162
    <d16>   DW_AT_decl_column : 30
    <d17>   DW_AT_type        : <0xe6>
    <d1b>   DW_AT_data_member_location: 84
 <2><d1c>: Abbrev Number: 3 (DW_TAG_member)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x621b6): StreamBaseAddress
    <d21>   DW_AT_decl_file   : 15
    <d22>   DW_AT_decl_line   : 164
    <d23>   DW_AT_decl_column : 30
    <d24>   DW_AT_type        : <0xda>
    <d28>   DW_AT_data_member_location: 88
 <2><d29>: Abbrev Number: 3 (DW_TAG_member)
    <d2a>   DW_AT_name        : (indirect string, offset: 0xb82ca): StreamIndex
    <d2e>   DW_AT_decl_file   : 15
    <d2f>   DW_AT_decl_line   : 166
    <d30>   DW_AT_decl_column : 30
    <d31>   DW_AT_type        : <0xda>
    <d35>   DW_AT_data_member_location: 92
 <2><d36>: Abbrev Number: 0
 <1><d37>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <d38>   DW_AT_byte_size   : 4
    <d38>   DW_AT_type        : <0x71a>
 <1><d3c>: Abbrev Number: 38 (DW_TAG_subroutine_type)
    <d3d>   DW_AT_prototyped  : 1
    <d3d>   DW_AT_sibling     : <0xd47>
 <2><d41>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <d42>   DW_AT_type        : <0xd47>
 <2><d46>: Abbrev Number: 0
 <1><d47>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <d48>   DW_AT_byte_size   : 4
    <d48>   DW_AT_type        : <0xc73>
 <1><d4c>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <d4d>   DW_AT_byte_size   : 4
    <d4d>   DW_AT_type        : <0xd3c>
 <1><d51>: Abbrev Number: 6 (DW_TAG_typedef)
    <d52>   DW_AT_name        : (indirect string, offset: 0xba5c8): DMA_HandleTypeDef
    <d56>   DW_AT_decl_file   : 15
    <d57>   DW_AT_decl_line   : 168
    <d58>   DW_AT_decl_column : 2
    <d59>   DW_AT_type        : <0xc73>
 <1><d5d>: Abbrev Number: 24 (DW_TAG_structure_type)
    <d5e>   DW_AT_byte_size   : 24
    <d5f>   DW_AT_decl_file   : 16
    <d60>   DW_AT_decl_line   : 46
    <d61>   DW_AT_decl_column : 9
    <d61>   DW_AT_sibling     : <0xdb4>
 <2><d65>: Abbrev Number: 3 (DW_TAG_member)
    <d66>   DW_AT_name        : (indirect string, offset: 0xa183b): Prescaler
    <d6a>   DW_AT_decl_file   : 16
    <d6b>   DW_AT_decl_line   : 48
    <d6c>   DW_AT_decl_column : 12
    <d6d>   DW_AT_type        : <0xda>
    <d71>   DW_AT_data_member_location: 0
 <2><d72>: Abbrev Number: 3 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0xc72f8): CounterMode
    <d77>   DW_AT_decl_file   : 16
    <d78>   DW_AT_decl_line   : 51
    <d79>   DW_AT_decl_column : 12
    <d7a>   DW_AT_type        : <0xda>
    <d7e>   DW_AT_data_member_location: 4
 <2><d7f>: Abbrev Number: 3 (DW_TAG_member)
    <d80>   DW_AT_name        : (indirect string, offset: 0xe84f1): Period
    <d84>   DW_AT_decl_file   : 16
    <d85>   DW_AT_decl_line   : 54
    <d86>   DW_AT_decl_column : 12
    <d87>   DW_AT_type        : <0xda>
    <d8b>   DW_AT_data_member_location: 8
 <2><d8c>: Abbrev Number: 3 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x59045): ClockDivision
    <d91>   DW_AT_decl_file   : 16
    <d92>   DW_AT_decl_line   : 58
    <d93>   DW_AT_decl_column : 12
    <d94>   DW_AT_type        : <0xda>
    <d98>   DW_AT_data_member_location: 12
 <2><d99>: Abbrev Number: 3 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0xe0272): RepetitionCounter
    <d9e>   DW_AT_decl_file   : 16
    <d9f>   DW_AT_decl_line   : 61
    <da0>   DW_AT_decl_column : 12
    <da1>   DW_AT_type        : <0xda>
    <da5>   DW_AT_data_member_location: 16
 <2><da6>: Abbrev Number: 3 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0xca9b5): AutoReloadPreload
    <dab>   DW_AT_decl_file   : 16
    <dac>   DW_AT_decl_line   : 72
    <dad>   DW_AT_decl_column : 12
    <dae>   DW_AT_type        : <0xda>
    <db2>   DW_AT_data_member_location: 20
 <2><db3>: Abbrev Number: 0
 <1><db4>: Abbrev Number: 6 (DW_TAG_typedef)
    <db5>   DW_AT_name        : (indirect string, offset: 0x4b783): TIM_Base_InitTypeDef
    <db9>   DW_AT_decl_file   : 16
    <dba>   DW_AT_decl_line   : 74
    <dbb>   DW_AT_decl_column : 3
    <dbc>   DW_AT_type        : <0xd5d>
 <1><dc0>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <dc1>   DW_AT_encoding    : 7	(unsigned)
    <dc1>   DW_AT_byte_size   : 1
    <dc1>   DW_AT_type        : <0x59>
    <dc5>   DW_AT_decl_file   : 16
    <dc5>   DW_AT_decl_line   : 291
    <dc7>   DW_AT_decl_column : 1
    <dc7>   DW_AT_sibling     : <0xdea>
 <2><dcb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dcc>   DW_AT_name        : (indirect string, offset: 0x88f86): HAL_TIM_STATE_RESET
    <dd0>   DW_AT_const_value : 0
 <2><dd1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x7f28): HAL_TIM_STATE_READY
    <dd6>   DW_AT_const_value : 1
 <2><dd7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x37158): HAL_TIM_STATE_BUSY
    <ddc>   DW_AT_const_value : 2
 <2><ddd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dde>   DW_AT_name        : (indirect string, offset: 0xb7085): HAL_TIM_STATE_TIMEOUT
    <de2>   DW_AT_const_value : 3
 <2><de3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <de4>   DW_AT_name        : (indirect string, offset: 0x86c9e): HAL_TIM_STATE_ERROR
    <de8>   DW_AT_const_value : 4
 <2><de9>: Abbrev Number: 0
 <1><dea>: Abbrev Number: 12 (DW_TAG_typedef)
    <deb>   DW_AT_name        : (indirect string, offset: 0x8f3e1): HAL_TIM_StateTypeDef
    <def>   DW_AT_decl_file   : 16
    <df0>   DW_AT_decl_line   : 297
    <df2>   DW_AT_decl_column : 3
    <df3>   DW_AT_type        : <0xdc0>
 <1><df7>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <df8>   DW_AT_type        : <0xdea>
 <1><dfc>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <dfd>   DW_AT_encoding    : 7	(unsigned)
    <dfd>   DW_AT_byte_size   : 1
    <dfd>   DW_AT_type        : <0x59>
    <e01>   DW_AT_decl_file   : 16
    <e01>   DW_AT_decl_line   : 303
    <e03>   DW_AT_decl_column : 1
    <e03>   DW_AT_sibling     : <0xe1a>
 <2><e07>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e08>   DW_AT_name        : (indirect string, offset: 0x9a0d4): HAL_TIM_CHANNEL_STATE_RESET
    <e0c>   DW_AT_const_value : 0
 <2><e0d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x8094d): HAL_TIM_CHANNEL_STATE_READY
    <e12>   DW_AT_const_value : 1
 <2><e13>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e14>   DW_AT_name        : (indirect string, offset: 0x69967): HAL_TIM_CHANNEL_STATE_BUSY
    <e18>   DW_AT_const_value : 2
 <2><e19>: Abbrev Number: 0
 <1><e1a>: Abbrev Number: 12 (DW_TAG_typedef)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x2e0fe): HAL_TIM_ChannelStateTypeDef
    <e1f>   DW_AT_decl_file   : 16
    <e20>   DW_AT_decl_line   : 307
    <e22>   DW_AT_decl_column : 3
    <e23>   DW_AT_type        : <0xdfc>
 <1><e27>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e28>   DW_AT_type        : <0xe1a>
 <1><e2c>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <e2d>   DW_AT_encoding    : 7	(unsigned)
    <e2d>   DW_AT_byte_size   : 1
    <e2d>   DW_AT_type        : <0x59>
    <e31>   DW_AT_decl_file   : 16
    <e31>   DW_AT_decl_line   : 313
    <e33>   DW_AT_decl_column : 1
    <e33>   DW_AT_sibling     : <0xe4a>
 <2><e37>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e38>   DW_AT_name        : (indirect string, offset: 0x44ea): HAL_DMA_BURST_STATE_RESET
    <e3c>   DW_AT_const_value : 0
 <2><e3d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e3e>   DW_AT_name        : (indirect string, offset: 0x78717): HAL_DMA_BURST_STATE_READY
    <e42>   DW_AT_const_value : 1
 <2><e43>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e44>   DW_AT_name        : (indirect string, offset: 0x49b3b): HAL_DMA_BURST_STATE_BUSY
    <e48>   DW_AT_const_value : 2
 <2><e49>: Abbrev Number: 0
 <1><e4a>: Abbrev Number: 12 (DW_TAG_typedef)
    <e4b>   DW_AT_name        : (indirect string, offset: 0x5681a): HAL_TIM_DMABurstStateTypeDef
    <e4f>   DW_AT_decl_file   : 16
    <e50>   DW_AT_decl_line   : 317
    <e52>   DW_AT_decl_column : 3
    <e53>   DW_AT_type        : <0xe2c>
 <1><e57>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e58>   DW_AT_type        : <0xe4a>
 <1><e5c>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <e5d>   DW_AT_encoding    : 7	(unsigned)
    <e5d>   DW_AT_byte_size   : 1
    <e5d>   DW_AT_type        : <0x59>
    <e61>   DW_AT_decl_file   : 16
    <e61>   DW_AT_decl_line   : 323
    <e63>   DW_AT_decl_column : 1
    <e63>   DW_AT_sibling     : <0xe86>
 <2><e67>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e68>   DW_AT_name        : (indirect string, offset: 0x7acfb): HAL_TIM_ACTIVE_CHANNEL_1
    <e6c>   DW_AT_const_value : 1
 <2><e6d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x7ad14): HAL_TIM_ACTIVE_CHANNEL_2
    <e72>   DW_AT_const_value : 2
 <2><e73>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e74>   DW_AT_name        : (indirect string, offset: 0x7ad2d): HAL_TIM_ACTIVE_CHANNEL_3
    <e78>   DW_AT_const_value : 4
 <2><e79>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e7a>   DW_AT_name        : (indirect string, offset: 0x7ad46): HAL_TIM_ACTIVE_CHANNEL_4
    <e7e>   DW_AT_const_value : 8
 <2><e7f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e80>   DW_AT_name        : (indirect string, offset: 0x5a3dc): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <e84>   DW_AT_const_value : 0
 <2><e85>: Abbrev Number: 0
 <1><e86>: Abbrev Number: 12 (DW_TAG_typedef)
    <e87>   DW_AT_name        : (indirect string, offset: 0x71b4a): HAL_TIM_ActiveChannel
    <e8b>   DW_AT_decl_file   : 16
    <e8c>   DW_AT_decl_line   : 329
    <e8e>   DW_AT_decl_column : 3
    <e8f>   DW_AT_type        : <0xe5c>
 <1><e93>: Abbrev Number: 16 (DW_TAG_structure_type)
    <e94>   DW_AT_byte_size   : 72
    <e95>   DW_AT_decl_file   : 16
    <e96>   DW_AT_decl_line   : 337
    <e98>   DW_AT_decl_column : 9
    <e98>   DW_AT_sibling     : <0xf1b>
 <2><e9c>: Abbrev Number: 2 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0xd46df): Instance
    <ea1>   DW_AT_decl_file   : 16
    <ea2>   DW_AT_decl_line   : 340
    <ea4>   DW_AT_decl_column : 39
    <ea5>   DW_AT_type        : <0xf1b>
    <ea9>   DW_AT_data_member_location: 0
 <2><eaa>: Abbrev Number: 2 (DW_TAG_member)
    <eab>   DW_AT_name        : (indirect string, offset: 0xb7025): Init
    <eaf>   DW_AT_decl_file   : 16
    <eb0>   DW_AT_decl_line   : 341
    <eb2>   DW_AT_decl_column : 38
    <eb3>   DW_AT_type        : <0xdb4>
    <eb7>   DW_AT_data_member_location: 4
 <2><eb8>: Abbrev Number: 2 (DW_TAG_member)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x71b58): Channel
    <ebd>   DW_AT_decl_file   : 16
    <ebe>   DW_AT_decl_line   : 342
    <ec0>   DW_AT_decl_column : 38
    <ec1>   DW_AT_type        : <0xe86>
    <ec5>   DW_AT_data_member_location: 28
 <2><ec6>: Abbrev Number: 2 (DW_TAG_member)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x830b5): hdma
    <ecb>   DW_AT_decl_file   : 16
    <ecc>   DW_AT_decl_line   : 343
    <ece>   DW_AT_decl_column : 39
    <ecf>   DW_AT_type        : <0xf20>
    <ed3>   DW_AT_data_member_location: 32
 <2><ed4>: Abbrev Number: 2 (DW_TAG_member)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x9baec): Lock
    <ed9>   DW_AT_decl_file   : 16
    <eda>   DW_AT_decl_line   : 345
    <edc>   DW_AT_decl_column : 38
    <edd>   DW_AT_type        : <0xb72>
    <ee1>   DW_AT_data_member_location: 60
 <2><ee2>: Abbrev Number: 2 (DW_TAG_member)
    <ee3>   DW_AT_name        : (indirect string, offset: 0xdf57e): State
    <ee7>   DW_AT_decl_file   : 16
    <ee8>   DW_AT_decl_line   : 346
    <eea>   DW_AT_decl_column : 38
    <eeb>   DW_AT_type        : <0xdf7>
    <eef>   DW_AT_data_member_location: 61
 <2><ef0>: Abbrev Number: 2 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xdea7e): ChannelState
    <ef5>   DW_AT_decl_file   : 16
    <ef6>   DW_AT_decl_line   : 347
    <ef8>   DW_AT_decl_column : 38
    <ef9>   DW_AT_type        : <0xf45>
    <efd>   DW_AT_data_member_location: 62
 <2><efe>: Abbrev Number: 2 (DW_TAG_member)
    <eff>   DW_AT_name        : (indirect string, offset: 0xdf0c4): ChannelNState
    <f03>   DW_AT_decl_file   : 16
    <f04>   DW_AT_decl_line   : 348
    <f06>   DW_AT_decl_column : 38
    <f07>   DW_AT_type        : <0xf45>
    <f0b>   DW_AT_data_member_location: 66
 <2><f0c>: Abbrev Number: 2 (DW_TAG_member)
    <f0d>   DW_AT_name        : (indirect string, offset: 0xde56a): DMABurstState
    <f11>   DW_AT_decl_file   : 16
    <f12>   DW_AT_decl_line   : 349
    <f14>   DW_AT_decl_column : 38
    <f15>   DW_AT_type        : <0xe57>
    <f19>   DW_AT_data_member_location: 70
 <2><f1a>: Abbrev Number: 0
 <1><f1b>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <f1c>   DW_AT_byte_size   : 4
    <f1c>   DW_AT_type        : <0xaf0>
 <1><f20>: Abbrev Number: 8 (DW_TAG_array_type)
    <f21>   DW_AT_type        : <0xf30>
    <f25>   DW_AT_sibling     : <0xf30>
 <2><f29>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f2a>   DW_AT_type        : <0x31>
    <f2e>   DW_AT_upper_bound : 6
 <2><f2f>: Abbrev Number: 0
 <1><f30>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <f31>   DW_AT_byte_size   : 4
    <f31>   DW_AT_type        : <0xd51>
 <1><f35>: Abbrev Number: 8 (DW_TAG_array_type)
    <f36>   DW_AT_type        : <0xe27>
    <f3a>   DW_AT_sibling     : <0xf45>
 <2><f3e>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f3f>   DW_AT_type        : <0x31>
    <f43>   DW_AT_upper_bound : 3
 <2><f44>: Abbrev Number: 0
 <1><f45>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <f46>   DW_AT_type        : <0xf35>
 <1><f4a>: Abbrev Number: 12 (DW_TAG_typedef)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x4b1fc): TIM_HandleTypeDef
    <f4f>   DW_AT_decl_file   : 16
    <f50>   DW_AT_decl_line   : 380
    <f52>   DW_AT_decl_column : 3
    <f53>   DW_AT_type        : <0xe93>
 <1><f57>: Abbrev Number: 18 (DW_TAG_variable)
    <f58>   DW_AT_name        : (indirect string, offset: 0x93d17): STREAM_OFFSET_TAB
    <f5c>   DW_AT_decl_file   : 17
    <f5d>   DW_AT_decl_line   : 46
    <f5e>   DW_AT_decl_column : 22
    <f5f>   DW_AT_type        : <0x6b8>
    <f63>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><f69>: Abbrev Number: 8 (DW_TAG_array_type)
    <f6a>   DW_AT_type        : <0xbd>
    <f6e>   DW_AT_sibling     : <0xf79>
 <2><f72>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f73>   DW_AT_type        : <0x31>
    <f77>   DW_AT_upper_bound : 6
 <2><f78>: Abbrev Number: 0
 <1><f79>: Abbrev Number: 15 (DW_TAG_const_type)
    <f7a>   DW_AT_type        : <0xf69>
 <1><f7e>: Abbrev Number: 18 (DW_TAG_variable)
    <f7f>   DW_AT_name        : (indirect string, offset: 0x35905): OFFSET_TAB_CCMRx
    <f83>   DW_AT_decl_file   : 6
    <f84>   DW_AT_decl_line   : 45
    <f85>   DW_AT_decl_column : 22
    <f86>   DW_AT_type        : <0xf79>
    <f8a>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><f90>: Abbrev Number: 18 (DW_TAG_variable)
    <f91>   DW_AT_name        : (indirect string, offset: 0x1fafd): SHIFT_TAB_OCxx
    <f95>   DW_AT_decl_file   : 6
    <f96>   DW_AT_decl_line   : 56
    <f97>   DW_AT_decl_column : 22
    <f98>   DW_AT_type        : <0xf79>
    <f9c>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><fa2>: Abbrev Number: 18 (DW_TAG_variable)
    <fa3>   DW_AT_name        : (indirect string, offset: 0xd1f36): SHIFT_TAB_ICxx
    <fa7>   DW_AT_decl_file   : 6
    <fa8>   DW_AT_decl_line   : 67
    <fa9>   DW_AT_decl_column : 22
    <faa>   DW_AT_type        : <0xf79>
    <fae>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><fb4>: Abbrev Number: 18 (DW_TAG_variable)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xce651): SHIFT_TAB_CCxP
    <fb9>   DW_AT_decl_file   : 6
    <fba>   DW_AT_decl_line   : 78
    <fbb>   DW_AT_decl_column : 22
    <fbc>   DW_AT_type        : <0xf79>
    <fc0>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><fc6>: Abbrev Number: 18 (DW_TAG_variable)
    <fc7>   DW_AT_name        : (indirect string, offset: 0xc3d7e): SHIFT_TAB_OISx
    <fcb>   DW_AT_decl_file   : 6
    <fcc>   DW_AT_decl_line   : 89
    <fcd>   DW_AT_decl_column : 22
    <fce>   DW_AT_type        : <0xf79>
    <fd2>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><fd8>: Abbrev Number: 24 (DW_TAG_structure_type)
    <fd9>   DW_AT_byte_size   : 20
    <fda>   DW_AT_decl_file   : 6
    <fdb>   DW_AT_decl_line   : 182
    <fdc>   DW_AT_decl_column : 9
    <fdc>   DW_AT_sibling     : <0x1022>
 <2><fe0>: Abbrev Number: 3 (DW_TAG_member)
    <fe1>   DW_AT_name        : (indirect string, offset: 0xa183b): Prescaler
    <fe5>   DW_AT_decl_file   : 6
    <fe6>   DW_AT_decl_line   : 184
    <fe7>   DW_AT_decl_column : 12
    <fe8>   DW_AT_type        : <0xc2>
    <fec>   DW_AT_data_member_location: 0
 <2><fed>: Abbrev Number: 3 (DW_TAG_member)
    <fee>   DW_AT_name        : (indirect string, offset: 0xc72f8): CounterMode
    <ff2>   DW_AT_decl_file   : 6
    <ff3>   DW_AT_decl_line   : 190
    <ff4>   DW_AT_decl_column : 12
    <ff5>   DW_AT_type        : <0xda>
    <ff9>   DW_AT_data_member_location: 4
 <2><ffa>: Abbrev Number: 3 (DW_TAG_member)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x9dbc3): Autoreload
    <fff>   DW_AT_decl_file   : 6
    <1000>   DW_AT_decl_line   : 196
    <1001>   DW_AT_decl_column : 12
    <1002>   DW_AT_type        : <0xda>
    <1006>   DW_AT_data_member_location: 8
 <2><1007>: Abbrev Number: 3 (DW_TAG_member)
    <1008>   DW_AT_name        : (indirect string, offset: 0x59045): ClockDivision
    <100c>   DW_AT_decl_file   : 6
    <100d>   DW_AT_decl_line   : 205
    <100e>   DW_AT_decl_column : 12
    <100f>   DW_AT_type        : <0xda>
    <1013>   DW_AT_data_member_location: 12
 <2><1014>: Abbrev Number: 3 (DW_TAG_member)
    <1015>   DW_AT_name        : (indirect string, offset: 0xe0272): RepetitionCounter
    <1019>   DW_AT_decl_file   : 6
    <101a>   DW_AT_decl_line   : 211
    <101b>   DW_AT_decl_column : 12
    <101c>   DW_AT_type        : <0xda>
    <1020>   DW_AT_data_member_location: 16
 <2><1021>: Abbrev Number: 0
 <1><1022>: Abbrev Number: 6 (DW_TAG_typedef)
    <1023>   DW_AT_name        : (indirect string, offset: 0xa4682): LL_TIM_InitTypeDef
    <1027>   DW_AT_decl_file   : 6
    <1028>   DW_AT_decl_line   : 224
    <1029>   DW_AT_decl_column : 3
    <102a>   DW_AT_type        : <0xfd8>
 <1><102e>: Abbrev Number: 39 (DW_TAG_variable)
    <102f>   DW_AT_name        : (indirect string, offset: 0x707aa): ulHighFrequencyTimerTicks
    <1033>   DW_AT_decl_file   : 7
    <1034>   DW_AT_decl_line   : 26
    <1035>   DW_AT_decl_column : 24
    <1036>   DW_AT_type        : <0xa0>
    <103a>   DW_AT_external    : 1
    <103a>   DW_AT_location    : 5 byte block: 3 78 0 0 20 	(DW_OP_addr: 20000078)
 <1><1040>: Abbrev Number: 40 (DW_TAG_subprogram)
    <1041>   DW_AT_external    : 1
    <1041>   DW_AT_name        : (indirect string, offset: 0x4a31b): HAL_IncTick
    <1045>   DW_AT_decl_file   : 18
    <1046>   DW_AT_decl_line   : 232
    <1047>   DW_AT_decl_column : 6
    <1048>   DW_AT_prototyped  : 1
    <1048>   DW_AT_declaration : 1
 <1><1048>: Abbrev Number: 25 (DW_TAG_subprogram)
    <1049>   DW_AT_external    : 1
    <1049>   DW_AT_name        : (indirect string, offset: 0x33bc0): osKernelStart
    <104d>   DW_AT_decl_file   : 11
    <104d>   DW_AT_decl_line   : 302
    <104f>   DW_AT_decl_column : 12
    <104f>   DW_AT_prototyped  : 1
    <104f>   DW_AT_type        : <0x13b>
    <1053>   DW_AT_declaration : 1
 <1><1053>: Abbrev Number: 25 (DW_TAG_subprogram)
    <1054>   DW_AT_external    : 1
    <1054>   DW_AT_name        : (indirect string, offset: 0xabb87): osKernelInitialize
    <1058>   DW_AT_decl_file   : 11
    <1058>   DW_AT_decl_line   : 287
    <105a>   DW_AT_decl_column : 12
    <105a>   DW_AT_prototyped  : 1
    <105a>   DW_AT_type        : <0x13b>
    <105e>   DW_AT_declaration : 1
 <1><105e>: Abbrev Number: 41 (DW_TAG_subprogram)
    <105f>   DW_AT_external    : 1
    <105f>   DW_AT_name        : (indirect string, offset: 0xcdfbe): HAL_Init
    <1063>   DW_AT_decl_file   : 18
    <1064>   DW_AT_decl_line   : 219
    <1065>   DW_AT_decl_column : 19
    <1066>   DW_AT_prototyped  : 1
    <1066>   DW_AT_type        : <0xb4b>
    <106a>   DW_AT_declaration : 1
 <1><106a>: Abbrev Number: 42 (DW_TAG_subprogram)
    <106b>   DW_AT_external    : 1
    <106b>   DW_AT_name        : (indirect string, offset: 0x9c4c8): LL_TIM_Init
    <106f>   DW_AT_decl_file   : 6
    <1070>   DW_AT_decl_line   : 4059
    <1072>   DW_AT_decl_column : 13
    <1073>   DW_AT_prototyped  : 1
    <1073>   DW_AT_type        : <0xb18>
    <1077>   DW_AT_declaration : 1
    <1077>   DW_AT_sibling     : <0x1086>
 <2><107b>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <107c>   DW_AT_type        : <0xf1b>
 <2><1080>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1081>   DW_AT_type        : <0x1086>
 <2><1085>: Abbrev Number: 0
 <1><1086>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <1087>   DW_AT_byte_size   : 4
    <1087>   DW_AT_type        : <0x1022>
 <1><108b>: Abbrev Number: 43 (DW_TAG_subprogram)
    <108c>   DW_AT_external    : 1
    <108c>   DW_AT_name        : (indirect string, offset: 0x297f0): HAL_InitTick
    <1090>   DW_AT_decl_file   : 18
    <1091>   DW_AT_decl_line   : 223
    <1092>   DW_AT_decl_column : 19
    <1093>   DW_AT_prototyped  : 1
    <1093>   DW_AT_type        : <0xb4b>
    <1097>   DW_AT_declaration : 1
    <1097>   DW_AT_sibling     : <0x10a1>
 <2><109b>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <109c>   DW_AT_type        : <0xda>
 <2><10a0>: Abbrev Number: 0
 <1><10a1>: Abbrev Number: 44 (DW_TAG_subprogram)
    <10a2>   DW_AT_external    : 1
    <10a2>   DW_AT_name        : (indirect string, offset: 0x246f8): LL_SetSystemCoreClock
    <10a6>   DW_AT_decl_file   : 19
    <10a7>   DW_AT_decl_line   : 280
    <10a9>   DW_AT_decl_column : 13
    <10aa>   DW_AT_prototyped  : 1
    <10aa>   DW_AT_declaration : 1
    <10aa>   DW_AT_sibling     : <0x10b4>
 <2><10ae>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <10af>   DW_AT_type        : <0xda>
 <2><10b3>: Abbrev Number: 0
 <1><10b4>: Abbrev Number: 26 (DW_TAG_subprogram)
    <10b5>   DW_AT_external    : 1
    <10b5>   DW_AT_name        : (indirect string, offset: 0x55db3): TIM8_UP_TIM13_IRQHandler
    <10b9>   DW_AT_decl_file   : 7
    <10b9>   DW_AT_decl_line   : 117
    <10ba>   DW_AT_decl_column : 6
    <10ba>   DW_AT_prototyped  : 1
    <10ba>   DW_AT_low_pc      : 0x80007dc
    <10be>   DW_AT_high_pc     : 0x2c
    <10c2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10c4>   DW_AT_call_all_tail_calls: 1
 <1><10c4>: Abbrev Number: 45 (DW_TAG_subprogram)
    <10c5>   DW_AT_external    : 1
    <10c5>   DW_AT_name        : (indirect string, offset: 0x63cae): getRunTimeCounterValue
    <10c9>   DW_AT_decl_file   : 7
    <10ca>   DW_AT_decl_line   : 113
    <10cb>   DW_AT_decl_column : 15
    <10cc>   DW_AT_prototyped  : 1
    <10cc>   DW_AT_type        : <0x99>
    <10d0>   DW_AT_low_pc      : 0x80007c4
    <10d4>   DW_AT_high_pc     : 0x18
    <10d8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10da>   DW_AT_call_all_calls: 1
 <1><10da>: Abbrev Number: 26 (DW_TAG_subprogram)
    <10db>   DW_AT_external    : 1
    <10db>   DW_AT_name        : (indirect string, offset: 0x2dffb): configureTimerForRunTimeStats
    <10df>   DW_AT_decl_file   : 7
    <10df>   DW_AT_decl_line   : 108
    <10e0>   DW_AT_decl_column : 6
    <10e0>   DW_AT_prototyped  : 1
    <10e0>   DW_AT_low_pc      : 0x80007a0
    <10e4>   DW_AT_high_pc     : 0x24
    <10e8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10ea>   DW_AT_call_all_tail_calls: 1
 <1><10ea>: Abbrev Number: 46 (DW_TAG_subprogram)
    <10eb>   DW_AT_external    : 1
    <10eb>   DW_AT_name        : (indirect string, offset: 0xb7764): HAL_TIM_PeriodElapsedCallback
    <10ef>   DW_AT_decl_file   : 7
    <10f0>   DW_AT_decl_line   : 102
    <10f1>   DW_AT_decl_column : 6
    <10f2>   DW_AT_prototyped  : 1
    <10f2>   DW_AT_low_pc      : 0x8000782
    <10f6>   DW_AT_high_pc     : 0x1e
    <10fa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10fc>   DW_AT_call_all_tail_calls: 1
    <10fc>   DW_AT_sibling     : <0x1110>
 <2><1100>: Abbrev Number: 47 (DW_TAG_formal_parameter)
    <1101>   DW_AT_name        : (indirect string, offset: 0xabc23): htim
    <1105>   DW_AT_decl_file   : 7
    <1106>   DW_AT_decl_line   : 102
    <1107>   DW_AT_decl_column : 56
    <1108>   DW_AT_type        : <0x1110>
    <110c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><110f>: Abbrev Number: 0
 <1><1110>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <1111>   DW_AT_byte_size   : 4
    <1111>   DW_AT_type        : <0xf4a>
 <1><1115>: Abbrev Number: 48 (DW_TAG_subprogram)
    <1116>   DW_AT_external    : 1
    <1116>   DW_AT_name        : (indirect string, offset: 0x15e8b): main
    <111a>   DW_AT_decl_file   : 7
    <111b>   DW_AT_decl_line   : 88
    <111c>   DW_AT_decl_column : 5
    <111d>   DW_AT_prototyped  : 1
    <111d>   DW_AT_type        : <0x2a>
    <1121>   DW_AT_low_pc      : 0x8000768
    <1125>   DW_AT_high_pc     : 0x1a
    <1129>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <112b>   DW_AT_call_all_tail_calls: 1
 <1><112b>: Abbrev Number: 27 (DW_TAG_subprogram)
    <112c>   DW_AT_name        : (indirect string, offset: 0xb701f): TIM13_Init
    <1130>   DW_AT_decl_file   : 7
    <1130>   DW_AT_decl_line   : 69
    <1131>   DW_AT_decl_column : 13
    <1131>   DW_AT_prototyped  : 1
    <1131>   DW_AT_low_pc      : 0x80006fc
    <1135>   DW_AT_high_pc     : 0x6c
    <1139>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <113b>   DW_AT_call_all_tail_calls: 1
    <113b>   DW_AT_sibling     : <0x114f>
 <2><113f>: Abbrev Number: 18 (DW_TAG_variable)
    <1140>   DW_AT_name        : (indirect string, offset: 0xccaea): LL_TIM_InitStruct
    <1144>   DW_AT_decl_file   : 7
    <1145>   DW_AT_decl_line   : 70
    <1146>   DW_AT_decl_column : 24
    <1147>   DW_AT_type        : <0x1022>
    <114b>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><114e>: Abbrev Number: 0
 <1><114f>: Abbrev Number: 27 (DW_TAG_subprogram)
    <1150>   DW_AT_name        : (indirect string, offset: 0x96f34): SystemClock_Config
    <1154>   DW_AT_decl_file   : 7
    <1154>   DW_AT_decl_line   : 41
    <1155>   DW_AT_decl_column : 13
    <1155>   DW_AT_prototyped  : 1
    <1155>   DW_AT_low_pc      : 0x8000660
    <1159>   DW_AT_high_pc     : 0x9c
    <115d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <115f>   DW_AT_call_all_tail_calls: 1
    <115f>   DW_AT_sibling     : <0x1174>
 <2><1163>: Abbrev Number: 49 (DW_TAG_inlined_subroutine)
    <1164>   DW_AT_abstract_origin: <0x156a>
    <1168>   DW_AT_low_pc      : 0x80006e8
    <116c>   DW_AT_high_pc     : 0x4
    <1170>   DW_AT_call_file   : 7
    <1171>   DW_AT_call_line   : 62
    <1172>   DW_AT_call_column : 9
 <2><1173>: Abbrev Number: 0
 <1><1174>: Abbrev Number: 7 (DW_TAG_subprogram)
    <1175>   DW_AT_name        : (indirect string, offset: 0x98ff2): LL_TIM_EnableIT_UPDATE
    <1179>   DW_AT_decl_file   : 6
    <117a>   DW_AT_decl_line   : 3457
    <117c>   DW_AT_decl_column : 22
    <117c>   DW_AT_prototyped  : 1
    <117c>   DW_AT_low_pc      : 0x800063e
    <1180>   DW_AT_high_pc     : 0x20
    <1184>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1186>   DW_AT_call_all_calls: 1
    <1186>   DW_AT_sibling     : <0x119b>
 <2><118a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <118b>   DW_AT_name        : (indirect string, offset: 0x22780): TIMx
    <118f>   DW_AT_decl_file   : 6
    <1190>   DW_AT_decl_line   : 3457
    <1192>   DW_AT_decl_column : 58
    <1193>   DW_AT_type        : <0xf1b>
    <1197>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><119a>: Abbrev Number: 0
 <1><119b>: Abbrev Number: 28 (DW_TAG_subprogram)
    <119c>   DW_AT_name        : (indirect string, offset: 0xc1b2a): LL_TIM_IsActiveFlag_UPDATE
    <11a0>   DW_AT_decl_file   : 6
    <11a1>   DW_AT_decl_line   : 3193
    <11a3>   DW_AT_decl_column : 26
    <11a3>   DW_AT_prototyped  : 1
    <11a3>   DW_AT_type        : <0xda>
    <11a7>   DW_AT_low_pc      : 0x8000618
    <11ab>   DW_AT_high_pc     : 0x26
    <11af>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <11b1>   DW_AT_call_all_calls: 1
    <11b1>   DW_AT_sibling     : <0x11c6>
 <2><11b5>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <11b6>   DW_AT_name        : (indirect string, offset: 0x22780): TIMx
    <11ba>   DW_AT_decl_file   : 6
    <11bb>   DW_AT_decl_line   : 3193
    <11bd>   DW_AT_decl_column : 66
    <11be>   DW_AT_type        : <0xf1b>
    <11c2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><11c5>: Abbrev Number: 0
 <1><11c6>: Abbrev Number: 7 (DW_TAG_subprogram)
    <11c7>   DW_AT_name        : (indirect string, offset: 0x55251): LL_TIM_ClearFlag_UPDATE
    <11cb>   DW_AT_decl_file   : 6
    <11cc>   DW_AT_decl_line   : 3182
    <11ce>   DW_AT_decl_column : 22
    <11ce>   DW_AT_prototyped  : 1
    <11ce>   DW_AT_low_pc      : 0x80005fc
    <11d2>   DW_AT_high_pc     : 0x1c
    <11d6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <11d8>   DW_AT_call_all_calls: 1
    <11d8>   DW_AT_sibling     : <0x11ed>
 <2><11dc>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <11dd>   DW_AT_name        : (indirect string, offset: 0x22780): TIMx
    <11e1>   DW_AT_decl_file   : 6
    <11e2>   DW_AT_decl_line   : 3182
    <11e4>   DW_AT_decl_column : 59
    <11e5>   DW_AT_type        : <0xf1b>
    <11e9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><11ec>: Abbrev Number: 0
 <1><11ed>: Abbrev Number: 7 (DW_TAG_subprogram)
    <11ee>   DW_AT_name        : (indirect string, offset: 0x850be): LL_TIM_DisableARRPreload
    <11f2>   DW_AT_decl_file   : 6
    <11f3>   DW_AT_decl_line   : 1315
    <11f5>   DW_AT_decl_column : 22
    <11f5>   DW_AT_prototyped  : 1
    <11f5>   DW_AT_low_pc      : 0x80005dc
    <11f9>   DW_AT_high_pc     : 0x20
    <11fd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <11ff>   DW_AT_call_all_calls: 1
    <11ff>   DW_AT_sibling     : <0x1214>
 <2><1203>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1204>   DW_AT_name        : (indirect string, offset: 0x22780): TIMx
    <1208>   DW_AT_decl_file   : 6
    <1209>   DW_AT_decl_line   : 1315
    <120b>   DW_AT_decl_column : 60
    <120c>   DW_AT_type        : <0xf1b>
    <1210>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1213>: Abbrev Number: 0
 <1><1214>: Abbrev Number: 7 (DW_TAG_subprogram)
    <1215>   DW_AT_name        : (indirect string, offset: 0x9e15b): LL_TIM_EnableCounter
    <1219>   DW_AT_decl_file   : 6
    <121a>   DW_AT_decl_line   : 1124
    <121c>   DW_AT_decl_column : 22
    <121c>   DW_AT_prototyped  : 1
    <121c>   DW_AT_low_pc      : 0x80005bc
    <1220>   DW_AT_high_pc     : 0x20
    <1224>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1226>   DW_AT_call_all_calls: 1
    <1226>   DW_AT_sibling     : <0x123b>
 <2><122a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <122b>   DW_AT_name        : (indirect string, offset: 0x22780): TIMx
    <122f>   DW_AT_decl_file   : 6
    <1230>   DW_AT_decl_line   : 1124
    <1232>   DW_AT_decl_column : 56
    <1233>   DW_AT_type        : <0xf1b>
    <1237>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><123a>: Abbrev Number: 0
 <1><123b>: Abbrev Number: 7 (DW_TAG_subprogram)
    <123c>   DW_AT_name        : (indirect string, offset: 0x7146c): LL_APB1_GRP1_EnableClock
    <1240>   DW_AT_decl_file   : 5
    <1241>   DW_AT_decl_line   : 1185
    <1243>   DW_AT_decl_column : 22
    <1243>   DW_AT_prototyped  : 1
    <1243>   DW_AT_low_pc      : 0x800058c
    <1247>   DW_AT_high_pc     : 0x30
    <124b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <124d>   DW_AT_call_all_calls: 1
    <124d>   DW_AT_sibling     : <0x1272>
 <2><1251>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1252>   DW_AT_name        : (indirect string, offset: 0xccd1a): Periphs
    <1256>   DW_AT_decl_file   : 5
    <1257>   DW_AT_decl_line   : 1185
    <1259>   DW_AT_decl_column : 56
    <125a>   DW_AT_type        : <0xda>
    <125e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1261>: Abbrev Number: 23 (DW_TAG_variable)
    <1262>   DW_AT_name        : (indirect string, offset: 0x19d9): tmpreg
    <1266>   DW_AT_decl_file   : 5
    <1267>   DW_AT_decl_line   : 1187
    <1269>   DW_AT_decl_column : 17
    <126a>   DW_AT_type        : <0xe6>
    <126e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1271>: Abbrev Number: 0
 <1><1272>: Abbrev Number: 7 (DW_TAG_subprogram)
    <1273>   DW_AT_name        : (indirect string, offset: 0x11eeb): LL_PWR_SetRegulVoltageScaling
    <1277>   DW_AT_decl_file   : 4
    <1278>   DW_AT_decl_line   : 505
    <127a>   DW_AT_decl_column : 22
    <127a>   DW_AT_prototyped  : 1
    <127a>   DW_AT_low_pc      : 0x8000564
    <127e>   DW_AT_high_pc     : 0x28
    <1282>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1284>   DW_AT_call_all_calls: 1
    <1284>   DW_AT_sibling     : <0x1299>
 <2><1288>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1289>   DW_AT_name        : (indirect string, offset: 0xe081f): VoltageScaling
    <128d>   DW_AT_decl_file   : 4
    <128e>   DW_AT_decl_line   : 505
    <1290>   DW_AT_decl_column : 61
    <1291>   DW_AT_type        : <0xda>
    <1295>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1298>: Abbrev Number: 0
 <1><1299>: Abbrev Number: 21 (DW_TAG_subprogram)
    <129a>   DW_AT_name        : (indirect string, offset: 0x75e9d): LL_FLASH_GetLatency
    <129e>   DW_AT_decl_file   : 3
    <129f>   DW_AT_decl_line   : 1569
    <12a1>   DW_AT_decl_column : 26
    <12a1>   DW_AT_prototyped  : 1
    <12a1>   DW_AT_type        : <0xda>
    <12a5>   DW_AT_low_pc      : 0x8000548
    <12a9>   DW_AT_high_pc     : 0x1c
    <12ad>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <12af>   DW_AT_call_all_calls: 1
 <1><12af>: Abbrev Number: 7 (DW_TAG_subprogram)
    <12b0>   DW_AT_name        : (indirect string, offset: 0x38ef0): LL_FLASH_SetLatency
    <12b4>   DW_AT_decl_file   : 3
    <12b5>   DW_AT_decl_line   : 1543
    <12b7>   DW_AT_decl_column : 22
    <12b7>   DW_AT_prototyped  : 1
    <12b7>   DW_AT_low_pc      : 0x8000520
    <12bb>   DW_AT_high_pc     : 0x28
    <12bf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <12c1>   DW_AT_call_all_calls: 1
    <12c1>   DW_AT_sibling     : <0x12d6>
 <2><12c5>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <12c6>   DW_AT_name        : (indirect string, offset: 0xdd061): Latency
    <12ca>   DW_AT_decl_file   : 3
    <12cb>   DW_AT_decl_line   : 1543
    <12cd>   DW_AT_decl_column : 51
    <12ce>   DW_AT_type        : <0xda>
    <12d2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><12d5>: Abbrev Number: 0
 <1><12d6>: Abbrev Number: 7 (DW_TAG_subprogram)
    <12d7>   DW_AT_name        : (indirect string, offset: 0xcff71): LL_RCC_PLL_ConfigDomain_SYS
    <12db>   DW_AT_decl_file   : 2
    <12dc>   DW_AT_decl_line   : 4304
    <12de>   DW_AT_decl_column : 22
    <12de>   DW_AT_prototyped  : 1
    <12de>   DW_AT_low_pc      : 0x80004d4
    <12e2>   DW_AT_high_pc     : 0x4c
    <12e6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <12e8>   DW_AT_call_all_calls: 1
    <12e8>   DW_AT_sibling     : <0x132d>
 <2><12ec>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <12ed>   DW_AT_name        : (indirect string, offset: 0xdd01a): Source
    <12f1>   DW_AT_decl_file   : 2
    <12f2>   DW_AT_decl_line   : 4304
    <12f4>   DW_AT_decl_column : 59
    <12f5>   DW_AT_type        : <0xda>
    <12f9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><12fc>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <12fd>   DW_AT_name        : (indirect string, offset: 0xb56f5): PLLM
    <1301>   DW_AT_decl_file   : 2
    <1302>   DW_AT_decl_line   : 4304
    <1304>   DW_AT_decl_column : 76
    <1305>   DW_AT_type        : <0xda>
    <1309>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><130c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <130d>   DW_AT_name        : (indirect string, offset: 0xb56fa): PLLN
    <1311>   DW_AT_decl_file   : 2
    <1312>   DW_AT_decl_line   : 4304
    <1314>   DW_AT_decl_column : 91
    <1315>   DW_AT_type        : <0xda>
    <1319>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><131c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <131d>   DW_AT_name        : (indirect string, offset: 0x47920): PLLP_R
    <1321>   DW_AT_decl_file   : 2
    <1322>   DW_AT_decl_line   : 4304
    <1324>   DW_AT_decl_column : 106
    <1325>   DW_AT_type        : <0xda>
    <1329>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><132c>: Abbrev Number: 0
 <1><132d>: Abbrev Number: 21 (DW_TAG_subprogram)
    <132e>   DW_AT_name        : (indirect string, offset: 0x168e6): LL_RCC_PLL_IsReady
    <1332>   DW_AT_decl_file   : 2
    <1333>   DW_AT_decl_line   : 4205
    <1335>   DW_AT_decl_column : 26
    <1335>   DW_AT_prototyped  : 1
    <1335>   DW_AT_type        : <0xda>
    <1339>   DW_AT_low_pc      : 0x80004ac
    <133d>   DW_AT_high_pc     : 0x28
    <1341>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1343>   DW_AT_call_all_calls: 1
 <1><1343>: Abbrev Number: 29 (DW_TAG_subprogram)
    <1344>   DW_AT_name        : (indirect string, offset: 0x3a73a): LL_RCC_PLL_Enable
    <1348>   DW_AT_decl_file   : 2
    <1348>   DW_AT_decl_line   : 4184
    <134a>   DW_AT_decl_column : 22
    <134a>   DW_AT_prototyped  : 1
    <134a>   DW_AT_low_pc      : 0x800048c
    <134e>   DW_AT_high_pc     : 0x20
    <1352>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1354>   DW_AT_call_all_calls: 1
 <1><1354>: Abbrev Number: 7 (DW_TAG_subprogram)
    <1355>   DW_AT_name        : (indirect string, offset: 0x974a5): LL_RCC_SetTIMPrescaler
    <1359>   DW_AT_decl_file   : 2
    <135a>   DW_AT_decl_line   : 4153
    <135c>   DW_AT_decl_column : 22
    <135c>   DW_AT_prototyped  : 1
    <135c>   DW_AT_low_pc      : 0x8000460
    <1360>   DW_AT_high_pc     : 0x2c
    <1364>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1366>   DW_AT_call_all_calls: 1
    <1366>   DW_AT_sibling     : <0x137b>
 <2><136a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <136b>   DW_AT_name        : (indirect string, offset: 0xa183b): Prescaler
    <136f>   DW_AT_decl_file   : 2
    <1370>   DW_AT_decl_line   : 4153
    <1372>   DW_AT_decl_column : 54
    <1373>   DW_AT_type        : <0xda>
    <1377>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><137a>: Abbrev Number: 0
 <1><137b>: Abbrev Number: 7 (DW_TAG_subprogram)
    <137c>   DW_AT_name        : (indirect string, offset: 0x9b559): LL_RCC_SetAPB2Prescaler
    <1380>   DW_AT_decl_file   : 2
    <1381>   DW_AT_decl_line   : 3256
    <1383>   DW_AT_decl_column : 22
    <1383>   DW_AT_prototyped  : 1
    <1383>   DW_AT_low_pc      : 0x8000438
    <1387>   DW_AT_high_pc     : 0x28
    <138b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <138d>   DW_AT_call_all_calls: 1
    <138d>   DW_AT_sibling     : <0x13a2>
 <2><1391>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1392>   DW_AT_name        : (indirect string, offset: 0xa183b): Prescaler
    <1396>   DW_AT_decl_file   : 2
    <1397>   DW_AT_decl_line   : 3256
    <1399>   DW_AT_decl_column : 55
    <139a>   DW_AT_type        : <0xda>
    <139e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><13a1>: Abbrev Number: 0
 <1><13a2>: Abbrev Number: 7 (DW_TAG_subprogram)
    <13a3>   DW_AT_name        : (indirect string, offset: 0xa182d): LL_RCC_SetAPB1Prescaler
    <13a7>   DW_AT_decl_file   : 2
    <13a8>   DW_AT_decl_line   : 3240
    <13aa>   DW_AT_decl_column : 22
    <13aa>   DW_AT_prototyped  : 1
    <13aa>   DW_AT_low_pc      : 0x8000410
    <13ae>   DW_AT_high_pc     : 0x28
    <13b2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <13b4>   DW_AT_call_all_calls: 1
    <13b4>   DW_AT_sibling     : <0x13c9>
 <2><13b8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <13b9>   DW_AT_name        : (indirect string, offset: 0xa183b): Prescaler
    <13bd>   DW_AT_decl_file   : 2
    <13be>   DW_AT_decl_line   : 3240
    <13c0>   DW_AT_decl_column : 55
    <13c1>   DW_AT_type        : <0xda>
    <13c5>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><13c8>: Abbrev Number: 0
 <1><13c9>: Abbrev Number: 7 (DW_TAG_subprogram)
    <13ca>   DW_AT_name        : (indirect string, offset: 0x17bea): LL_RCC_SetAHBPrescaler
